Map husinAlMuslim = {
  "أذكار الاستيقاظ من النوم": {
    "text": [
      "الحَمْدُ لله الذِي أحْيَانا بَعْدَ مَا أمَاتَنَا* وإلَيْهِ النَشُور*  ",
      "الحَمْدُ لله الذِي عَافَانِي في جَسَدِي ورَدَّ عَلَيَّ رُوحِي، وأَذِنَ لي بِذِكْرهِ ",
      "قال رسول الله صلى الله عليه وسلم  مَنْ تَعَارَ مِنَ اللَّيْل*  فقال حين يستيقظ : لا إلَهَ إلاَّ الله وحْدَهُ لا شَرِيكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُوَ على كلِّ شيءٍ قَدير،سُبْحانَ الله والحَمْدُ لله  ولا إله إلا الله والله أكبر ولا حَولَ ولا قُوةَ إلا بالله العلي العظيم  ثم دعا:  اللَّهُمَّ اغْفِرْ لي، غُفِرَ له ، قال الوليد: أو قال:  دعا استُجيبَ لهُ، فإن قام فتوضأَ ثم صَلّى قُبِلَتْ صَلاتُهُ .",
      "{إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لآيَاتٍ لِّأُوْلِي الألْبَابِ *الَّذِينَ يَذْكُرُونَ اللّهَ قِيَاماً وَقُعُوداً وَعَلَىَ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ*رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ *رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِياً يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ * رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ *فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لاَ أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَى بَعْضُكُم مِّن بَعْضٍ فَالَّذِينَ هَاجَرُواْ وَأُخْرِجُواْ مِن دِيَارِهِمْ وَأُوذُواْ فِي سَبِيلِي وَقَاتَلُواْ وَقُتِلُواْ لأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ ثَوَاباً مِّن عِندِ اللّهِ وَاللّهُ عِندَهُ حُسْنُ الثَّوَابِ *لاَ يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُواْ فِي الْبِلاَدِ *مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ *لَكِنِ الَّذِينَ اتَّقَوْاْ رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا نُزُلاً مِّنْ عِندِ اللّهِ وَمَا عِندَ اللّهِ خَيْرٌ لِّلأَبْرَارِ * وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللّهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَا أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلّهِ لاَ يَشْتَرُونَ بِآيَاتِ اللّهِ ثَمَناً قَلِيلاً أُوْلَـئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ إِنَّ اللّهَ سَرِيعُ الْحِسَابِ *يَا أَيُّهَا الَّذِينَ آمَنُواْ اصْبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَاتَّقُواْ اللّهَ لَعَلَّكُمْ تُفْلِحُونَ }"
    ],
    "footnote": [
      "* أي الموت المجازي وهو النوم، يقال النوم الموت الخفيف",
      "* الإحياء بعد الإماتة (البعثة)",
      "البخاري مع الفتح 11/ 113 ومسلم 4/ 2083",
      "الترمذي 5/ 473 وانظر صحيح الترمذي3/144",
      "* التعار السهر والتقلب على الفراش ليلاً مع الكلام.",
      "رواه البخاري مع الفتح 3/ 144 وغيرها واللفظ لابن ماجه انظر صحيح ابن ماجه 2/ 335",
      "الآيات من سورة آل عمران ،190 – 200 ، البخاري مع الفتح 8/ 238 ومسلم 1/ 530"
    ]
  },
  "دعاء لبس الثوب": {
    "text": [
      "مَنْ لَبِسَ ثَوْباًً فقال: الحَمْدُ لله الذِي كَساني هذا( الثوب ) ورَزَقَنِيه مِنْ غَيْرِ حَوْلٍ مِنّي ولا قُوةٍ "
    ],
    "footnote": ["أخرجه أهل السنن إلا النسائي انظر إرواء الغليل 7/ 47"]
  },
  "دعاء لبس الثوب الجديد": {
    "text": [
      "اللَّهُمَّ لَكَ الحَمْدُ أَنْتَ كَسَوتَنِيه،أسْألك مِنْ خَيرِهِ وخَيْرَ ما صُنع لَهُ،وأعُوذُ بِكَ مِنْ شرِّه وشَرَّ ما صُنِعَ لَهُ "
    ],
    "footnote": [
      "أبو داود والترمذي والبغوي وانظر مختصر شمائل الترمذي للألباني ص 47"
    ]
  },
  "الدعاء لمن لبس ثوباً جديداً": {
    "text": [
      "إلبِسْ جَدِيداً وعِشْ حميداً ومُتْ شهيداً ",
      "تُبْلي ويَخْلِفُ الله تعالى "
    ],
    "footnote": [
      "ابن ماجه 2/ 1178 والبغوي 12/ 41 وانظر صحيح ابن ماجة 2/ 275",
      "أخرجه أبو داود 4/ 41 ، وانظر صحيح أبي داود 2/ 760"
    ]
  },
  "ما يقول إذا وضع الثوب": {
    "text": [
      "سِتْرُ ما بَيْنَ أعْيُن الجِنِّ وَعَوْرَاتِ بَني آدَمَ إذا وَضَعَ أحدُهُمْ ثَوْبَهُ أنْ يقول:  بِسم الله  "
    ],
    "footnote": ["الترمذي 2/505 وغيره وانظر الإرواء برقم 49 صحيح الجامع 3/ 203"]
  },
  "دعاء دخول الخلاء": {
    "text": ["{بسم الله}، اللهُمَّ إنّي أعُوذُ بِكَ مِنَ الخُبْثِ والخبائِثِ "],
    "footnote": [
      "أخرجه البخاري 1/ 45 ومسلم 1/283 وزيادة بسم الله في أوله متفق عليه، أخرجها سعيد بن منصور أنظر فتح الباري 1/244"
    ]
  },
  "دعاء الخروج من الخلاء": {
    "text": ["غُفْرانَكَ "],
    "footnote": [
      "أخرجه أصحاب السنن إلا النسائي أخرجه في عمل اليوم والليلة انظر تخريج زاد المعاد 2/ 387"
    ]
  },
  "الذكر قبل الوضوء": {
    "text": ["بسم الله "],
    "footnote": ["أبو داود وابن ماجه وأحمد وانظر إرواء الغليل 1/ 122"]
  },
  "الذكر بعد الفراغ من الوضوء": {
    "text": [
      "أشهد أن لا إله إلا الله وحده لا شريك له ، وأشهد أن محمداً عبده ورسوله",
      "وزاد الترمذي بعد ذكر الشهادتين :اللهم اجعلني من التوابين واجعلني من المتطهرين",
      "سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك"
    ],
    "footnote": [
      "رواه مسلم 1/ 209",
      "الترمذي 1/ 78 وانظر صحيح الترمذي 1/ 18",
      "النسائي في عمل اليوم والليلة ص173 وانظر  إرواء الغليل 1/ 135 و2/  94"
    ]
  },
  "الذكر عند الخروج من المنزل": {
    "text": [
      "بسم الله ، توكَّلْتُ على الله ، ولا حَوْلَ ولا قُوةَ إلا بالله ",
      "اللهُمَ إني أعُوذُ بِكَ أن أَضِلَّ أوْ أُضَلَّ أَوْ أزِلَّ، أو أُزَلَّ، أوْ أظلِم أوْ أُظْلَم، أوْ أَجْهَلَ أوْ يُجْهَلَ عَلَيَّ "
    ],
    "footnote": [
      " أبو داود 4/ 325 والترمذي 5/ 490 وانظر صحيح الترمذي 3/ 151",
      "أهل السنن وانظر صحيح الترمذي 3/ 152 وصحيح ابن ماجه 2/ 336"
    ]
  },
  "الذكر عند الدخول المنزل": {
    "text": [
      "بسم الله ولجنا ،وبسم الله خرجنا ، وعلى ربنا توكلنا ، ثم ليسلم على أهله"
    ],
    "footnote": [
      "أخرجه أبو داود 4/ 325 ، وحسن إسناده العلامة ابن باز في تحفة الأخيار ص28 ، وفي الصحيح  إذا دخل الرجل بيته فذكر بيته فذكر الله عند دخوله وعند طعامه قال الشيطان لا مبيت لكم ولا عشاء  مسلم برقم 2018"
    ]
  },
  "دعاء الذهاب إلى المسجد": {
    "text": [
      "اللهم اجعل في قلبي نوراً ، وفي لساني نوراً ، وفي سمعي نوراً ، وفي بصري نوراً ، ومن فوقي نوراً ، ومن تحتي نوراً ، وعن يميني نوراً ، وعن شمالي نوراً ، ومن أمامي نوراً ، ومن خلفي نوراً  ، و اجعل في نفسي نوراً ، وأعظم لي نوراً ، وعظم لي نوراً ، واجعل لي نوراً ، واجعلني نوراً ، اللهم أعطني نوراً ، واجعل في عصبي نوراً ، وفي لحمي نوراً ، وفي دمي نوراً ، وفي شعري نوراً ، وفي بشري نوراً ",
      "اللهم اجعل لي نوراً في قبري .. ونوراً في عظامي ",
      "وزدني نوراً ، وزدني نوراً ، وزدني نوراً ",
      "وهب لي نوراً على نوراً "
    ],
    "footnote": [
      "جميع هذه الخصال في البخاري 11/ 116 برقم 6316 ومسلم 1/ 526، 529 ، 530 برقم 763",
      "الترمذي برقم 3419، 5/483",
      "أخرجه البخاري في الأدب المفرد برقم 695 ، ص 258 وصحح إسناده الألباني في صحيح الأدب المفرد برقم 536",
      "ذكره ابن حجر في فتح الباري وعزاه إلى ابن أبي عاصم في كتاب الدعاء،انظر الفتح 11/118 وقال: فاجتمع من اختلاف الروايات خمس وعشرون خصلة"
    ]
  },
  "دعاء دخول المسجد": {
    "text": [
      "أعوذ بالله العظيم ،وبوجهه الكريم ،وسلطانه القديم ،من الشيطان الرجيم ",
      "[ بسم الله ،والصلاة ] [ والسلام على رسول الله] ، اللهم افتح لي أبواب رحمتك"
    ],
    "footnote": [
      "أبو داود وانظر صحيح الجامع برقم 4591",
      "رواه ابن السني برقم 88 وحسنه الألباني",
      "أبو داود 1/ 126 وانظر صحيح الجامع 1/ 528",
      " رواه مسلم1/ 494. وفي سنن ابن ماجه من حديث فاطمة رضي الله عنها  اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك  وصححه الألباني لشواهده انظر صحيح ابن ماجه 1/ 128 – 129"
    ]
  },
  "دعاء الخروج من المسجد": {
    "text": [
      "بسم الله والصلاة والسلام على رسول الله ،اللهم إني أسألك من فضلك، اللهم اعصمني من الشيطان الرجيم "
    ],
    "footnote": [
      "انظر تخريج روايات الحديث السابق رقم 20 وزيادة (( اللهم اعصمني من الشيطان الرجيم )) لابن ماجه . انظر صحيح ابن ماجه 1/ 288"
    ]
  },
  "أذكار الأذان": {
    "text": [
      "يقول مثل ما يقول المؤذن إلا في حي على الصلاة ، وحي على الفلاح فيقول لا حول ولا قوة إلا بالله",
      "يقول  وأنا أشهد أن لا إله إلا الله ، وحده لا شريك له ، وأن محمد عبده ورسوله ، رضيت بالله رباً ، وبمحمداً رسولاً وبالإسلام ديناً (( يقول ذلك عقب تشهد المؤذن)) ",
      "يصلي على النبي صلى الله عليه وسلم بعد فراغه من إجابة المؤذن",
      "اللهم رب هذه الدعوة التامة ،والصلاة القائمة، آت محمداً الوسيلة والفضيلة، وأبعثه مقاماً محموداً الذي وعدته، [ إنك لا تخلف الميعاد ]",
      "يدعو لنفسه بين الأذان والإقامة فإن الدعاء حينئذٍ لا يرد "
    ],
    "footnote": [
      "البخاري 1/ 152 ومسلم 1/ 288",
      "مسلم 1/290",
      "ابن خزيمة 1/ 220",
      "مسلم 1/ 288",
      "البخاري 1/ 152 وما بين المعكوفين للبيهقي 1/ 410 وحسن إسناده العلامة عبد العزيز بن باز في تحفة الأخيار ص 38",
      "الترمذي وأبو داود وأحمد وانظر إرواء الغليل 1/ 262"
    ]
  },
  "دعاء الاستفتاح": {
    "text": [
      "اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب ، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس اللهم اغسلني من خطاياي بالماء والثلج والبرد ",
      "سبحانك اللهم وبحمد ك وتبارك اسمك وتعالى جدك، ولا أ له غيرك ",
      "وجهت وجهي للذي فطر السموات والأرض حنيفاً وما أنا من المشركين ،إن صلاتي ونُسُكي ومحياي ومماتي لله رب العالمين ، لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت ، أنت ربي وأنا عبدك ، ظلمت نفسي ، واعترفت بذنبي ، فاغفر لي ذنوبي جميعاً ، إنه لا يغفر الذنوب إلا أنت ، واهدني لأحسن الأخلاق، لا يهدي لأحسنها إلا أنت ، واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله بيديك ، والشر ليس إليك ، أنا بك وإليك ، تباركت وتعاليت أستغفرك وأتوب إليك ",
      "اللهم رب جبرائيل وميكائيل وإسرافيل ، فاطر السموات والأرض ، عالم الغيب والشهادة ، أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ",
      "الله اكبر كبيرا، الله اكبر كبيرا، الله اكبر كبيرا، والحمد لله كثيرا، والحمد لله كثيرا، والحمد لله كثيرا، وسبحان الله بكرةً وأصيلا ـ ثلاثا ـ  أعوذ بالله من الشيطان الرجيم : من نفخه، ونفثه ،و همزه ",
      "كان النبي صلى الله عليه وسلم إذا قام من الليل يتهجد قال:  اللهم لك الحمد أنت نور السموات والأرض ومن فيهن ، ولك الحمد أنت قيمُ السموات والأرض ومن فيهن [ ولك الحمد أنت رب السموات والأرض ومن فيهن ]، [ ولك الحمد لك ملك السموات والأرض ومن فيهن ] [ ولك الحمد أنت ملك السموات والأرض] [ ولك الحمد] أنت الحق ، ووعدك الحق ، وقولك الحق ،ولقاؤك الحق ، والجنة حق ، والنار حق ، والنبيّون حق ومحمد صلى الله عليه وسلم حق والساعة حق ] [اللهم لك أسلمت ،  وعليك توكلت ، وبك آمنت ، وإليك أنبت ، وبك خاصمت ، وإليك حاكمت ، فاغفر لي ما قدمت وما أخرت ، وأسررت، وما أعلنت ] [ أنت المقدم ،وأنت المؤخر لا إله إلا أنت ] [أنت إلهي لا إله إلا أنت] "
    ],
    "footnote": [
      "البخاري 1/ 181 ومسلم 1/ 419",
      "أخرجه أصحاب السنن الأربعة وانظر صحيح الترمذي 1/77 وصحيح ابن ماجه 1/ 135",
      "رواه مسلم1/ 534",
      "رواه مسلم1/ 534",
      "أخرجه أبو داود 1/ 203 وابن ماجه 1/ 265 وأحمد 4/85 وأخرجه مسلم عن ابن عمر رضي الله عنهماا بنحوه وفيه قصة 1/ 420",
      "البخاري مع الفتح 3/3 و11/116 و 13/ 371 423، 465 ومسلم مختصراً بنحوه 1/ 532"
    ]
  },
  "دعاء الركوع": {
    "text": [
      "سبحان ربي العظيم  ثلاث مرات ",
      "سبحانك اللهم ربنا وبحمدك ، اللهم اغفر لي  ",
      "سبوح قدوس رب الملائكة والروح  ",
      "اللهم لك ركعت وبك آمنت ،ولك أسلمت خشع لك سمعي وبصري ودمي ولحمي وعظمي وعصبي،وما استقل به قدمي  ",
      "سبحان ذي الجبروت والملكوت والكبرياء والعظمة  "
    ],
    "footnote": [
      "أخرجه أهل السنن وأحمد وانظر صحيح الترمذي 1/83",
      "البخاري 1/199 ومسلم 1/ 350",
      "مسلم 1/ 353 وأبو داود 1/230",
      "مسلم 1/534 والأربعة إلا ابن ماجه",
      "أبو داود 1/ 230 والنسائي وأحمد وإسناده حسن"
    ]
  },
  "دعاء الرفع من الركوع": {
    "text": [
      "سمع الله لمن حمده  ",
      "ربنا ولك الحمد ، حمداً كثيراً طيباً مباركاً فيه  ",
      "....ملء السموات وملء الأرض وما بينهما ، وملء ما شئت من شئ بعد .أهل الثناء والمجد،أحق ما قال العبد، وكلنا لك عبد ، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد  "
    ],
    "footnote": [
      "البخاري مع الفتح 2/ 282",
      " البخاري مع الفتح 2/ 282",
      "مسلم 1/ 346"
    ]
  },
  "دعاء السجود": {
    "text": [
      "سبحان ربي الأعلى  ، ثلاث مرات . ",
      "سبحانك اللهم ربنا وبحمدك ، اللهم اغفر لي  ",
      "سبوح قدوس رب الملائكة والروح  ",
      "اللهم لك سجدت وبك آمنت ولك أسلمت،سجد وجهي للذي خلقه وصوره وشق سمعه وبصره تبارك الله أحسن الخالقين  ",
      "سبحان ذي الجبروت والملكوت ، والكبرياء والعظمة  ",
      "اللهم اغفر لي ذنبي كله ، دقه وجله ،وأوله وآخره ،وعلانيته وسره  ",
      "اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك،وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك  "
    ],
    "footnote": [
      "أخرجه أهل السنن وأحمد وانظر صحيح الترمذي 1/83",
      "البخاري ومسلم وتقدم تخريجه برقم 34",
      "مسلم 1/ 533وتقدم برقم 35",
      "مسلم1/ 534 وغيره",
      "أبو داود 1/ 230 والنسائي وأحمد وإسناده وصححه الألباني في صحيح أبي داود 166",
      "مسلم 1/ 350",
      "مسلم 1/ 352"
    ]
  },
  "دعاء الجلسة بين السجدتين": {
    "text": [
      "رب اغفر لي ، رب اغفر لي  ",
      "اللهم اغفر لي ، وارحمني ،واهدني ، واجبرني،  وعافني،وارزقني ، وارفعني  "
    ],
    "footnote": [
      "أبو داود 1/ 231وانظر  صحيح ابن ماجة1/ 148",
      "أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 1/90 وصحيح ابن ماجه 1/ 148"
    ]
  },
  "دعاء سجود التلاوة": {
    "text": [
      "سجد وجهي للذي خلقه ، وشق سمعه وبصره بحوله وقوته { فتبارك الله أحسن الخالقين } ",
      "اللهم أكتب لي بها عندك أجراً ، وضع عني بها وزراً ، واجعلها لي عندك ذخراً ، وتقبلها مني كما تقبلتها من عبدك داود  "
    ],
    "footnote": [
      "الترمذي 2/474 وأحمد 6/30 والحاكم وصححه ووافقه الذهبي 1/ 220 والزيادة له",
      "الترمذي 2/473 والحاكم وصححه ووافقه الذهبي 1/ 219"
    ]
  },
  "التشهد": {
    "text": [
      "التحيات لله ، والصلوات ، والطيبات ، السلام عليك أيها النبي ورحمة الله وبركاته ، السلام علينا وعلى عباد الله الصالحين ،أشهد أن لا إله إلا الله ، وأشهد أن محمداً عبده ورسوله "
    ],
    "footnote": ["البخاري مع الفتح 1/13 ومسلم 1/ 301"]
  },
  "الصلاة على النبي صلى الله عليه وسلم بعد التشهد": {
    "text": [
      "اللهم صل على محمد وعلى آل محمد ، كما صليت على  إبراهيم ، وعلى آل إبراهيم ، إنك حميد مجيد ، اللهم بارك على محمد وعلى آل محمد كما باركت على إبراهيم ، وعلى آل إبراهيم إنك حميد مجيد  ",
      "اللهم صل على محمد وعلى أزواجه وذريته،كما صليت على آل إبراهيم، وبارك على محمد وعلى أزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد "
    ],
    "footnote": [
      "البخاري مع الفتح 6/ 408",
      "البخاري مع الفتح 6/  407ومسلم 1/ 306 واللفظ له"
    ]
  },
  "الدعاء بعد التشهد الأخير وقبل السلام": {
    "text": [
      "اللهم إني أعوذ بك من عذاب القبر،ومن عذاب جهنم،ومن فتنة المحيا والممات ،ومن شر فتنة المسيح الدجال ",
      "اللهم إني أعوذ بك من عذاب القبر،وأعوذ بك من فتنة المسيح الدجال،وأعوذ بك من فتنة المحيا والممات، اللهم إني أعوذ بك من المأثم والمغرم  ",
      "اللهم إني ظلمت نفسي ظلماً كثيراً ، ولا يغفر الذنوب إلا أنت ، فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم  ",
      "اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت  ",
      "اللهم أعني على ذكرك ، وشكرك وحسن عبادتك  ",
      "اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن ، وأعوذ بك من أن أرد إلى أرذل العمر ، وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر  ",
      "اللهم إني أسألك الجنة وأعوذ بك من النار   ",
      "اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيراً لي وتوفني إذا علمت الوفاة خيراً لي ، اللهم إني أسألك خشيتك في الغيب والشهادة ، وأسألك كلمة الحق في الرضا والغضب ، وأسألك القصد في الغنى والفقر ، وأسألك نعيماً لا ينفد ، وأسألك قرة عين لا تنقطع ، وأسألك الرضا بعد القضاء ، وأسألك برد العيش بعد الموت ، وأسألك لذة النظر إلى وجهك والشوق إلى لقائك من غير ضرَّاء مضرة ولا فتنة مضلة ، اللهم زينا بزينة الإيمان ، واجعلنا هداة مهتدين  ",
      "اللهم إني أسألك يا الله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفواً أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم  ",
      "اللهم إني أسألك بأن لك الحمد ، لا إله إلا أنت وحدك لا شريك لك ، المنان ، يا بديع السموات والأرض يا ذا الجلال والإكرام يا حي يا قيوم إني أسألك الجنة وأعوذ بك من النار  ",
      "اللهم إني أسألك بأني أشهد أنك أنت الله لا إله إلا أنت،الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفواً أحد "
    ],
    "footnote": [
      "البخاري 2/ 102 ومسلم 1/ 412 واللفظ لمسلم  ",
      "البخاري 1/ 202 ومسلم 1/ 412  ",
      "البخاري 8/168 ومسلم 4/ 2078",
      "مسلم 1/ 534",
      "أبو داود 2/ 86والنسائي 3/ 53 وصححه الألباني في صحيح أبو داود 1/ 284",
      "البخاري 6/35",
      "أبو داود وانظر صحيح ابن ماجه 2/ 328",
      "النسائي 4/54،55وأحمد 4/364 وصححه الألباني في صحيح النسائي 1/ 281",
      "أخرجه النسائي بلفظه 3/52وأحمد 4/338 وصححه الألباني في صحيح النسائي 1/ 280",
      "رواه أهل السنن وانظر صحيح ابن ماجه 2/ 329",
      "أبو داود2/62والترمذي 5/ 515 وابن ماجه 2/ 1267 وأحمد 5/360 وانظر صحيح ابن ماجه 2/ 329 وصحيح الترمذي 3/ 163"
    ]
  },
  "الأذكار بعد السلام من الصلاة": {
    "text": [
      "أستغفر الله  ثلاثاً .. اللهم أنت السلام ، ومنك السلام ، تباركت يا ذا الجلال والإكرام ",
      "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ ",
      "لا إله إلا الله وحده لا شريك له،له الملك وله الحمد وهو على كل شئ قدير،لا حول ولا قوة إلا بالله،لا إله إلا الله،ولا نعبد إلا إياه ، له النعمة وله الفضل ،وله الثناء الحسن،لا إله إلا الله مخلصين له الدين ولو كره الكافرون ",
      "سبحان الله ، والحمد لله ، والله أكبر ( ثلاثاً وثلاثين ) لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شيء قدير ",
      "بسم الله الرحمن الرحيم{ قُلْ هُوَ اللَّهُ أَحَدٌ*اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ} بسم الله الرحمن الرحيم {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِن شَرِّ مَا خَلَقَ *وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ } بسم الله الرحمن الرحيم{ قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ *مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }بعد كل صلاة مرة واحدة , وبعد صلاة المغرب والفجر ثلاث مرات ",
      "{ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }عقب كل صلاة ",
      "لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد ، يحيي ويميت وهو على كل شئ قدير  عشر مرات بعد صلاة المغرب والصبح ",
      "اللهم إني أسألك علماً نافعاً ، ورزقاً طيباً ، وعملاً متقبلاً بعد السلام من صلاة الفجر "
    ],
    "footnote": [
      "مسلم1/ 414",
      "البخاري 1 /255 ومسلم 1 / 414",
      "مسلم 1/ 415",
      "مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418",
      "أبو داود2 /86 والنسائي 3/ 68 وانظر صحيح الترمذي 2/8 والسور الثلاث يقال لها المعوذات وانظر فتح الباري 9 / 62",
      "من قرأها دبر كل صلاة لم يمنعه من دخول الجنة إلا أن يموت . والنسائي في عمل اليوم والليلة برقم 100 ، وابن السني برقم 121 وصححه الجامع 5/339 وسلسلة الأحاديث الصحيحة 2/697 برقم 972",
      "رواه الترمذي 5/515 وأحمد 4/ 227 وانظر تخريجه في زاد المعاد 1/300",
      "ابن ماجه وغيره وانظر صحيح ابن ماجة1/ 152 ومجمع الزوائد 10/111"
    ]
  },
  "دعاء صلاة الاستخارة": {
    "text": [
      "قال جابر بن عبد الله رضي الله عنهما : كان رسول الله صلى الله عليه وسلم ، يُعلمنا الاستخارة في الأمور كلها كما يعلمُنا السورة من القرآن ، يقول : إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ، ثم ليقل : اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك ، وأسألك من فضلك العظيم فإنك تقدِرُ ولا أقدِرُ ، وتعلم ولا أعلم ، وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر -يسمي حاجته خير لي في ديني ومعاشي وعاقبة أمري أو قال : عاجلة وآجله فاقدره لي ويسره لي ، ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري أو قال : عاجله وآجله فاصرفه عني واصرفني عنه ، واقدر لي الخير حيث كان ، ثم ارضني به ",
      "وما ندم من استخار الخالق ، وشاور المخلوقين المؤمنين وتثبت في أمره ، فقد قال سبحانه{ وَشَاوِرْهُمْ فِي الأَمْرِ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللّهِ} "
    ],
    "footnote": ["البخاري7/ 162", "سورة آل عمران ، آية : 159"]
  },
  "أذكار الصباح والمساء": {
    "text": [
      "الحمد لله وحده ، والصلاة والسلام على من لا نبي بعده ",
      "أعوذ بالله من الشيطان الرجيم { اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ } ",
      "بسم الله الرحمن الرحيم{ قُلْ هُوَ اللَّهُ أَحَدٌ*اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ} بسم الله الرحمن الرحيم {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِن شَرِّ مَا خَلَقَ *وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ } بسم الله الرحمن الرحيم{ قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ *مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }( ثلاث مرات ) ",
      "أصبحنا وأصبح الملك لله ، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده  وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بك من عذابٍ في النار وعذاب في القبر  وإذا أمسي قال ذلك أيضا :  أمسينا وأمسي الملك لله .",
      "اللهم بك أصبحنا وبك أمسينا  وبك نحيا وبك نموت وإليك النشور    وإذا أمسي فليقل :  اللهم بك أمسينا، وبك أصبحنا، وبك نحيا وبك نموت، وإليك المصير .",
      "اللهم أنت ربي لا إله إلا أنت خَلَقتني وأنا عَبْدُك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء  لك بنعمتك علي وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت ",
      "اللهم إني أصبحت  أشهدك وأشهد حملة عرشك ، وملائكتك وجميع خلقك ، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك ، وأن محمداً عبدك ورسولك ( أربع مرات ) ",
      "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك ، فلك الحمد ولك الشكر ",
      "اللهم عافني في بَدَني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت .اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت ( ثلاث مرات ) ",
      "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم (سبع مرات ) ",
      "اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي،اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي ",
      "اللهم عَالِمَ الغيب والشَّهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن اقترف على نفسي سوءًا أو أجُره إلى مسلم ",
      "بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم  ( ثلاث مرات )",
      "رضيت بالله رباً ، وبالإسلام ديناً وبمحمد صلى الله عليه وسلم نبياً  ( ثلاث مرات ) ",
      "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كُله ولا تَكِلْني إلى نفسي طرفة عين ",
      "أصبحنا وأصبح الملك لله رب العالمين  ، اللهم إني أسألك خير هذا اليوم  : فتحه، ونصره ،ونوره ،وبركته، وهداه، وأعوذ بك من شر ما فيه وشر ما بعده ",
      "أصبحنا على فطرة الإسلام وعلى كلمة الإخلاص، وعلى دين نبيَّنا محمد صلى الله عليه وسلم وعلى ملَّة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين ",
      "من قال :سبحان الله وبحمده( مائة مرة ) ",
      "لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير( عشر مرات)  ( أو مرة واحدة عند الكسل) ",
      "لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير(مائة مرة إذا أصبح ) ",
      "سبحان الله وبحمده عدد خلقهِ ورِضَا نفسِهِ وزِنُة عَرشِهِ ومِداد كلماته( ثلاث مرات إذا أصبح ) ",
      "اللهم إني أسألك علماً نافعاً ، ورزقاً طيباً ، وعملاً متقبلاً  ( إذا أصبح ) ",
      "أستغفر الله وأتوب إليه  (مائة مرة في اليوم ) ",
      "أعوذ بكلمات الله التامات من شر ما خلق ( ثلاث مرات إذا أمسى) ",
      "اللهم صل وسلم على نبينا محمد  (عشر مرات ) "
    ],
    "footnote": [
      "عن أنس يرفعه  لأن أقعد مع قوم يذكرون الله تعالى من صلاة الغداة حتى تطلع الشمس أحب إلي من أن أعتق أربعة من ولد إسماعيل ، ولأن أقعد مع قوم يذكرون الله من صلاة العصر إلى أن تغرب الشمس أحب إلي من أن أعتق أربعة  أبو داود برقم 3667، وحسنه الألباني ، صحيح أبو داود 2/ 698",
      "سورة البقرة ، آية 255 من قالها حين يمسي أجير منهم حتى يصبح أخرجه الحاكم 1/ 562وصححه الألباني في صحيح الترغيب والترهيب 1/ 273 وعزاه إلى النسائي والطبراني وقال : وإسناد الطبراني جيد",
      "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء . أبو داود 4/ 322 والترمذي 5/ 567وانظر صحيح الترمذي 3/ 182",
      "وإذا أمسى قال : أمسينا وأمسى الملك لله",
      "وإذا أمسى قال : ربِّ أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها",
      "مسلم 4/ 2088",
      "وإذا أمسى قال: اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك المصير",
      "الترمذي 5/ 466 وانظر صحيح الترمذي 3/ 142",
      "أقر وأعترف",
      "من قالها موقناً بها حين يمسي فمات من ليلته دخل الجنة ، وكذلك إذا أصبح أخرجه البخاري 7/150",
      "وإذا أمسى قال : اللهم إني أمسيت",
      "من قالها حين يصبح وحين يمسي أربع مرات أعتقه الله من النار . أخرجه أبو داود 4/ 317 والبخاري في الأدب المفرد برقم 1201 والنسائي في عمل اليوم والليلة برقم 9، وابن السني برقم 70 وحسن سماحة الشيخ ابن باز إسناد النسائي وأبي داود في تحفة الأخيار ص 23",
      "وإذا أمسى قال : اللهم ما أمسى بي",
      "من قالها حين يصبح فقد أدي شكر يومه ، ومن قالها حين يمسى فقد أدى شكر ليلته . أخرجه أبو داود 4/318 ، والنسائي في عمل اليوم والليلة برقم 7وابن السني برقم 41 وابن حبان (( موارد)) رقم 2361وحسن ابن باز إسناده في تحفة الأخيار ص24",
      "أبو داود 4/ 324، وأحمد 5/ 42 والنسائي في عمل اليوم والليلة برقم 22وابن السني برقم 69والبخاري في الأدب المفرد وحسن العلامة ابن باز في تحفة الأخيار ص26",
      "من قالها حين يصبح ويمسي سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة .أخرجه ابن السني برقم 71مرفوعاً وأبو موقوف 4/321،وصحح إسناده شعيب وعبد القادر الأرناؤوط . انظر زاد المعاد 2/ 376",
      "أبو داود وابن ماجه وانظر صحيح ابن ماجه 2/332",
      "الترمذي وأبو داود .انظر :صحيح الترمذي3/ 142",
      "من قالها ثلاثاً إذا أصبح وثلاثاً إذا أمسى لم يضره شيء أخرجه أبو داود 4/ 323 والترمذي 5/ 465 وابن ماجه وأحمد . انظر : صحيح ابن ماجه 2/332 وحسن إسناده العلامة ابن باز في تحفة الأخيار ص39",
      "من قالها ثلاثاً حين يصبح وحين يمسي كان حقاً على الله أن يرضيه يوم القيامة . أحمد 4/ 337 والنسائي في عمل اليوم والليلة برقم 4 وابن السني برقم 68 وأبو داود 4/418 والترمذي 5/465 وحسنه ابن باز في تحفة الأخيار ص 39",
      " الحاكم وصححه ووافقه الذهبي 1/ 545 وانظر صحيح الترغيب والترهيب 1/273",
      "وإذا أمسى قال: أمسينا وأمسى الملك لله رب العالمين",
      "وإذا أمسى قال: اللهم إني أسألك خير هذه الليلة فتحها ونصرها ونورها وبركتها وهداها وأعوذ بك من شر ما فيها وشر ما بعدها",
      "أبو داود 4/ 322 وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد 2/ 273",
      "وإذا أمسى قال: أمسينا على فطرة الإسلام",
      "أحمد 3/ 406و 407 وابن السني في عمل اليوم والليلة برقم 34 وانظر : صحيح الجامع 4/ 209",
      "من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد رواه مسلم4 / 2071",
      "النسائي في عمل اليوم والليلة برقم 24 وانظر :صحيح الترغيب والترهيب 1/272 ،وتحفة الأخيار لابن باز ص44وانظر فضلها في ص146 ،حديث رقم 255",
      "أبو داود 4/319 وابن ماجه وأحمد 4/60 وانظر :صحيح الترغيب والترهيب 1/270 ،صحيح أبو داود 3/957 ، وصحيح ابن ماجه 2/331 وزاد المعاد 2/ 377",
      "من قالها مائة مرة في يوم كانت له عدل عشر رقاب، وكتب له مائة حسنة ،ومحيت عنه مائة سيئة ، وكانت حرزاً من الشيطان يومه ذلك حتى يمسي ،ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك . البخاري 4/95،ومسلم 4/2071",
      "مسلم 4/2090",
      "أخرجه ابن السني في عمل اليوم والليلة برقم 54وابن ماجه برقم 925وحسن إسناده عبد القادر وشعيب الأرناؤوط في تحقيق زاد المعاد 2/375",
      "البخاري مع الفتح 11/ 101 ، ومسلم 4/ 2075",
      "من قالها حين يمسي ثلاث مرات لم تضره حمة تلك الليلة أخرجه أحمد 2/290 والنسائي في عمل اليوم والليلة برقم 590 وابن السني برقم 68وانظر : صحيح الترمذي 3/187، وصحيح ابن ماجه 2/266 وتحفة الأخيار ص45",
      "من صلى علي حين يُصبح عشراً ، وحين يُمسي عشراً أدركتهُ شفاعتي يوم القيامة... ,رواه الطبراني بإسنادين أحدهما جيد ، انظر الزائد 10/ 120 وصحيح الترغيب والترهيب 1/273"
    ]
  },
  "أذكار النوم": {
    "text": [
      "يجمع كفيه ثم ينفث فيهما فيقرأ:بسم الله الرحمن الرحيم { قُلْ هُوَ اللَّهُ أَحَدٌ*اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ*وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ} بسم الله الرحمن الرحيم {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ*مِن شَرِّ مَا خَلَقَ*وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ*وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ } بسم الله الرحمن الرحيم { قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ *مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ } ثم يمسح بهما ما استطاع من جسده يبدأبهما على رأسه ووجهه وما أقبل من جسده ( يفعل ذلك ثلاث مرات ) ",
      "{ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ } ",
      "{ آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ * لاَ يُكَلِّفُ اللّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ } ",
      "باسمك  ربي وضعت جنبي وبك أرفعه إن أمسكت نفسي فارحمها، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين ",
      "اللهم خَلَقْتَ نفسي وأنت توفَّاها لك مماتها ومَحْياها، إن أحييتها فاحفظها وإن أمتها فاغفر لها، اللهم إني أسألك العافية ",
      "اللهم قني  عذابك يوم تبعث عبادك ( ثلاث مرات ) ",
      "باسمِكَ اللهم أموت وأحيا ",
      "سبحان الله ( ثلاثاً وثلاثين ) والحمد لله ( ثلاثاً وثلاثين ) والله أكبر ( أربعاً وثلاثين ) ",
      "اللهم ربَّ السموات السبع،ورب العرش العظيم،ربنا ورب كل شيء، فالق الحب والنوى، ومُنزل التوراة والإنجيل والفرقان، أعوذ بك من شر كل شيء أنت آخذٌ بناصيته،اللهم أنت الأول فليس قبلك شيء،وأنت الآخر فليس بعدك شيء، وأنت الظاهر فليس فوقك شيء، وأنت الباطن فليس دونك شيء، اقض عنا الدَّيْنَ واغننا من الفقر ",
      "الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا فكم ممن لا كافي له ولا مؤوي ",
      "اللهم عالم الغيب والشهادة، فاطر السموات والأرض، رب كل شيء ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي، ومن شر الشيطان وشركه وأن أقترف على نفسي سوءًا أو أجرَّه إلى مسلم ",
      "يقرأ { ألم } تنزيل السجدة، و { تبارك الذي بيده الملك } ",
      "اللهم   أسلمت نفسي إليك، وفوضت أمري إليك وألجأت ظهري إليك رهبةً ورغبةً إليك، لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت وبنبيك الذي أرسلت "
    ],
    "footnote": [
      "البخاري مع الفتح 9/62ومسلم 4/1723",
      "من قرأها إذا أوى إلى فراشه فإنه لن يزال عليه من الله حافظ ولا يقربه شيطان حتى يصبح البخاري مع الفتح 4/487",
      "من قرأها في ليلة كفتاه، البخاري مع الفتح 9/ 94 ومسلم 1/ 554 ، والآيتان من سورة البقرة ، 285 – 286",
      "إذا قام أحدكم من فراشه ثم رجع إليه فلينفض بصنفة  إزاره ثلاث مرات وليسم الله  فإنه لا يدري ماذا خلفه عليه بعده وإذا اضطجع فليقل ...  الحديث",
      "البخاري 11/ 126 .ومسلم 4/ 2084",
      "رواه مسلم4/ 2083وأحمد بلفظه 2/79",
      "كان الرسول صلى الله عليه وسلم إذا أراد أن يرقد وضع يده اليمنى تحت خده ثم يقول .......... الحديث",
      "أبو داود بلفظه 4/311 وانظر صحيح الترمذي3/ 143",
      "البخاري مع الفتح 11/113 ومسلم 4/ 2083",
      "من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم البخاري مع الفتح 7/71 ومسلم 4/ 2091",
      "مسلم 4/ 2084",
      "مسلم 4/ 2085",
      "أبو داود 4/ 317 وانظر صحيح سنن الترمذي3/ 142",
      "الترمذي والنسائي وانظر صحيح الجامع 4/ 255",
      "إذا أخذت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن، وقل:.... الحديث",
      "قال صلى الله عليه وسلم لمن قال ذلك : فإن متَّ،متَّ على الفطرة  البخاري مع الفتح 11/113 ومسلم 4/ 2081"
    ]
  },
  "الدعاء إذا تقلب ليلاً": {
    "text": [
      "لا إله إلا الله الواحد القهار، ربُّ السموات والأرض وما بينهما العزيز الغفار "
    ],
    "footnote": [
      "يقول ذلك إذا تقلب من جنب إلى جنب في الليل . أخرجه الحاكم وصححه ووفقه الذهبي 1/ 540 والنسائي في اليوم والليلة وابن السني وانظر صحيح الجامع 4/213"
    ]
  },
  "دعاء القلق والفزع في النوم ومن بلي بالوحشة": {
    "text": [
      "أعوذ بكلمات الله التَّامَّة من غضبه وعقابه، وشر عباده، ومن همزات الشياطين وأنْ يحضرون "
    ],
    "footnote": ["أبو داود 4/12 نظر صحيح الترمذي3/ 171"]
  },
  "ما يفعل من رأى الرؤيا أو الحلم": {
    "text": [
      "ينفث عن يساره ( ثلاثاً ) ",
      "يستعيذ بالله من الشيطان ومن شر ما رأى ( ثلاث مرات ) ",
      "لا يحدث بها أحدا ً ",
      "يتحول عن جنبه الذي كان عليه ",
      "يقوم يصلي إن أراد ذلك "
    ],
    "footnote": [
      "مسلم4/1772",
      "مسلم4/1773",
      "مسلم4/1772",
      "مسلم4/1773",
      "مسلم4/1773"
    ]
  },
  "دعاء قنوت الوتر": {
    "text": [
      "اللهم اهدني فيمن هديت ، وعافني فيمن عافيت ، وتولني فيمن توليت ، وبارك لي فيما أعطيت ، وقني شر ما قضيت ، فإنك تقضي ولا يقضى عليك ، إنه لا يذل من واليت ،[ ولا يعز من عاديت ] تباركت ربنا وتعاليت ",
      "اللهم إني أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك ، وأعوذ بك منك لا أحصي ثناء عليك ، أنت كما أثنيت على نفسك ",
      "اللهم إياك نعبد ، ولك نُصلي ونسجد ، وإليك نسعى ونحفدُ ، نرجُو رحمتك ، ونخشى عذابك ، إن عذابك بالكافرين ملحق ، اللهم إنا نستعينك ، ونستغفرك ، ونثني عليك الخير ، ولا نكفرك ، ونؤمن بك ونخضع لك ، ونخلع من يكفرك "
    ],
    "footnote": [
      "أخرجه أصحاب السنن الأربعة وأحمد والدرامي والحاكم والبيهقي وما بين المعكوفين للبيهقي وانظر صحيح الترمذي 1/144وصحيح ابن ماجه 1/194 وإرواء الغليل للألباني 2/172",
      "أخرجه أصحاب السنن الأربعة وأحمد. انظر صحيح الترمذي 3/180وصحيح ابن ماجه 1/194 والإرواء 2/175",
      "أخرجه البيهقي في السنن الكبرى وصحح إسناده 2/211 وقال الشيخ الألباني في إرواء الغليل وهذا إسناد صحيح 2/170 .وهو موقوف على عمر"
    ]
  },
  "الذكر عقب السلام من الوتر": {
    "text": [
      "كان رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يقرأ في الوتر :( سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى ) و ( وَقُلْ يَا أَيُّهَا الْكَافِرُونَ ) و ( وَقُلْ هُوَ اللَّهُ أَحَدٌ ). فإذا سلم قال  سبحان الملك القدوس [ رب الملائكة والروح ] ثلاث مرات والثالثة يجهر بها ويمد بها صوته "
    ],
    "footnote": [
      "رواه النسائي 3/244 والدار قطني وغيرهما وما بين المعكوفين زيادة للدار قطني 2/31 وإسناده صحيح .انظر زاد المعاد بتحقيق شعيب الأرناؤوط وعبد القادر الأرناؤوط 1/337"
    ]
  },
  "دعاء الهم والحزن": {
    "text": [
      "اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك،ماضِ في حكمك ، عدل في قضاؤك ،أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري ،وجلاء حزني وذهاب همي ",
      "اللهم إني أعوذ بك من الهم والحزن ، والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال "
    ],
    "footnote": [
      "أحمد 1/391وصححه الألباني",
      "البخاري 7/158 كان رسول الله صلى الله عليه وسلم يكثر من هذا الدعاء."
    ]
  },
  "دعاء الكرب": {
    "text": [
      "لا إله إلا الله العظيم الحليم ، لا إله إلا الله رب العرش العظيم ، لا إله إلا الله رب السموات ورب العرش الكريم ",
      "اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين ِ وأصلح لي شأني كله لا إله إلا أنت ",
      "لا إله إلا أنت سبحانك إني كنت من الظالمين ",
      "الله الله ربي لا أشرك به شيئاً "
    ],
    "footnote": [
      "البخاري 7/154ومسلم 4/ 2092",
      "أبو داود 4/324 وأحمد 5/42 وحسنه الألباني في صحيح أبو داود 3/ 959",
      "الترمذي 5/529 والحاكم وصححه ووفقه الذهبي 1/505 وانظر صحيح الترمذي3/ 168",
      "أخرجه أبو داود 2/87 وانظر صحيح ابن ماجه 2/335"
    ]
  },
  "دعاء لقاء العدو وذي السلطان": {
    "text": [
      "اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم ",
      "اللهم أنت عضُدي وأنت نصيري ، بك أحولُ ،وبك أصولُ ، وبك أُقاتلُ ",
      "حسبنا الله ونعم الوكيل "
    ],
    "footnote": [
      "أبو داود 2/89 وصححه الحاكم ووافقه الذهبي 2/142",
      "أبو داود 3/42 والترمذي 5/572 ،وانظر صحيح الترمذي3/183",
      "البخاري 5/172"
    ]
  },
  "دعاء من خاف ظلم السلطان": {
    "text": [
      "اللهم رب السموات السبع ،ورب العرش العظيم ،كن لي جاراً من فلان بن فلان ، وأحزابه من خلائقك ؛ أن يفرط على أحد منهم أو يطغى ، عز جارك ،وجل ثناؤك ،ولا إله إلا أنت ",
      "الله أكبر، الله أعز من خلقه جميعاً ، الله أعز مما أخاف وأحذر ،أعوذ بالله الذي لا إله إلا هو ، الممسك السموات السبع أن يقعن على الأرض إلا بإذنه ،من شر عبدك فلان ،وجنوده وأتباعه وأشياعه ، من الجن والأنس ، اللهم كن لي جاراً من شرهم ، جل ثناؤك وعز جارك ، وتبارك اسمك ، ولا إله غيرك  ( ثلاث مرات ) "
    ],
    "footnote": [
      "البخاري في الأدب المفرد برقم 707 وصححه الألباني وفي صحيح الأدب المفرد برقم 545",
      "البخاري في الأدب المفرد برقم 708 وصححه الألباني وفي صحيح الأدب المفرد برقم"
    ]
  },
  "الدعاء على العدو": {
    "text": [
      "اللهم منزل الكتاب ، سريع الحساب ،اهزم الأحزاب ،اللهم اهزمهم وزلزلهم "
    ],
    "footnote": ["مسلم 3/1362"]
  },
  "ما يقول من خاف قوماً": {
    "text": [" اللهم اكفنيهم بما شئت "],
    "footnote": ["مسلم 4/2300"]
  },
  "دعاء من أصابه شك في الإيمان": {
    "text": [
      "يستعيذ بالله ",
      "ينتهي عما شك فيه ",
      "يقول آمنت بالله ورسله ",
      "يقرأ قوله تعالى { هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ } "
    ],
    "footnote": [
      "البخاري مع الفتح 6/336 ومسلم 1/120",
      "البخاري مع الفتح 6/336 ومسلم 1/120",
      " مسلم 1/  120",
      "سورة الحديد ، الآية :3 .أبو داود 4/329 وحسنه الألباني في صحيح أبو داود 3/962"
    ]
  },
  "الدعاء قضاء الدين": {
    "text": [
      "اللهم اكفني بحلالك عن حرامك ، وأغنني بفضلك عمن سواك ",
      "اللهم إني أعوذ بك من الهم والحزن ، والعجز والكسل ،والبخل والجبن وضلع الدين وغلبة الرجال "
    ],
    "footnote": ["الترمذي 5/560 وانظر صحيح الترمذي3/ 180", " البخاري7/ 158"]
  },
  "دعاء الوسوسة في الصلاة والقراءة": {
    "text": ["أعوذ بالله من الشيطان الرجيم واتفل على يسارك ( ثلاثاً ) "],
    "footnote": [
      "مسلم 4/1729 من حديث عثمان بن العاص رضي الله عنه وفيه ففعلت ذلك فأذهبه الله عني"
    ]
  },
  "دعاء من استصعب عليه أمر": {
    "text": ["اللهم لا سهل إلا ما جعلته سهلاً وأنت تجعل الحزن إذا شئت سهلاً "],
    "footnote": [
      "رواة ابن حبان في صحيحه برقم 2427 (موارد) وابن السني برقم 351 وقال الحافظ هذا حديث صحيح وصححه عبد القادر الأرناؤوط في تخريج الأذكار للنووي ص106"
    ]
  },
  "ما يقول ويفعل من أذنب ذنباً": {
    "text": [
      "ما من عبدٍ يذنب ذنباً فيحسن الطهور ، ثم يقوم فيصلي ركعتين ، ثم يستغفر الله إلا غفر الله لهُ "
    ],
    "footnote": [
      "أبو داود 2/86 والترمذي 2/257 وصححه الألباني في صحيح أبي داود 1/ 283"
    ]
  },
  "دعاء طرد الشيطان ووساوسه": {
    "text": ["الاستعاذة بالله منه ", "الأذان ", "الأذكار وقراءة القرآن "],
    "footnote": [
      "أبو داود 1/206 والترمذي وانظر صحيح الترمذي 1/77 وانظر سورة المؤمنون آية 98-99",
      "مسلم 1/ 291 والبخاري 1/151",
      " لاتجعلوا بيوتكم مقابر إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة  رواه مسلم 1/539 ومما يطرد الشيطان أذكار الصباح والمساء ، والنوم والاستيقاظ ، وأذكار دخول المنزل والخروج منه وأذكار دخول المسجد والخروج منه وغير ذلك من الأذكار المشروعة مثل قراءة آية الكرسي عند النوم ، والآيتين الأخيرتين من سورة  البقرة ، ومن قال لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير مائة مرة كانت له حرزاً من الشيطان يومه كله ،وكذا الأذان يطرد الشيطان"
    ]
  },
  "الدعاء حينما يقع مالا يرضاه أو غلب على أمره": {
    "text": [
      "قدر الله وما شاء فعل ",
      "إذا غلبك أمر فقل :  حسبي الله ونعم الوكيل "
    ],
    "footnote": [
      "المؤمن القوي خير وأحب إلى الله من المؤمن الضعف وفي كل خير ،احرص على ما ينفعك واستعن بالله ولا تعجز وإن أصابك شيء فلا تقل لو أني فعلت كذا وكذا ولكن قل قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان  .مسلم 4/2052",
      "انظر تخريج الأذكار للأرناؤوط ص 106"
    ]
  },
  "تهنئة المولود له وجوابه": {
    "text": [
      "بارك الله لك في الموهوب لك ،وشكرت الواهب، وبلغ أشدهُ، ورزقت برهُ  .ويردُ عليه المهنأ فيقول :  بارك الله لك وبارك عليك ، وجزاك الله خيراً ، ورزقك الله مثله، وأجزل ثوابك "
    ],
    "footnote": [
      "انظر الأذكار للنووي ص349 وصحيح الأذكار للنووي ، لسليم الهلالي 2/713"
    ]
  },
  "ما يعوذ به الأولاد": {
    "text": [
      "كان رسول الله صلى الله عليه وسلم يعوذ الحسن والحسين أعيذكما بكلمات الله التامة ، من كل شيطان وهامة ، ومن كل عينِ لامة "
    ],
    "footnote": ["البخاري 4/119 من حديث ابن عباس رضي الله عنهما"]
  },
  "الدعاء للمريض في عيادته": {
    "text": [
      "لا بأس طهور إن شاء الله  ",
      "أسأل الله العظيم رب العرش العظيم أن يشفيك ( سبع مرات ) "
    ],
    "footnote": [
      "البخاري مع الفتح 10/ 118",
      "ما من عبد مسلم يعود مريضاً لم يحضر أجله فيقول: سبع مرات.....الحديث إلا عوفي . أخرجه الترمذي وأبو داود وانظر صحيح الترمذي2/ 210 وصحيح الجامع 5/180"
    ]
  },
  "فضل عيادة المريض": {
    "text": [
      "قال صلى الله عليه وسلم : إذا عاد الرجل أخاه المسلم مشى في خرافة الجنة حتى يجلس فإذا جلس غمرته الرحمة ، فإن كان غدوة صلى عليه سبعون ألف ملك حتى يمسي ، وإن كان مساء صلى عليه سبعون ألف ملك حتى يصبح "
    ],
    "footnote": [
      "رواه الترمذي وابن ماجه وأحمد وانظر صحيح ابن ماجه 1/244 وصحيح الترمذي 1/286 وصححه أيضاً أحمد شاكر"
    ]
  },
  "دعاء المريض الذي يئس من حياته": {
    "text": [
      "اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى ",
      "جعل النبي صلى الله عليه وسلم يدخل يديه في الماء فيمسح بهما وجههُ ويقول : لا إله إلا الله إن للموت لسكرات ",
      "لا إله إلا الله والله أكبر ، لا إله إلا الله وحده ، لا إله إلا الله وحده لا شريك لهُ ، لا إله إلا الله لهُ الملك ولهُ الحمد ، لا إله إلا الله ولا حول ولا قوة إلا بالله "
    ],
    "footnote": [
      "البخاري 7/10 ومسلم 4/1893",
      "البخاري مع الفتح 8/144وفي الحديث السواك",
      "أخرجه الترمذي وابن ماجه وصححه الألباني ، وانظر صحيح الترمذي 3/152وصحيح ابن ماجه 2/317"
    ]
  },
  "تلقين المحتضر": {
    "text": ["من كان آخر كلامه لا إله إلا الله دخل الجنة "],
    "footnote": ["أبو داود 3/190 وانظر صحيح الجامع 5/432"]
  },
  "دعاء من أصيب بمصيبة": {
    "text": [
      "إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيراً منها "
    ],
    "footnote": ["مسلم 2/632"]
  },
  "الدعاء عند إغماض الميت": {
    "text": [
      "اللهم اغفر  لفلان ( باسمه ) ورفع درجته في المهديين، واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين ،وافسح له في قبره ونور له فيه "
    ],
    "footnote": ["مسلم 2/634"]
  },
  "الدعاء للميت في الصلاة عليه": {
    "text": [
      "اللهم اغفر له وارحمه، وعافه ،واعف عنه ،وأكرم نُزُله ، ووسع مُدخلهُ ، واغسله بالماء والثلج والبرد ، ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس ، وأبدله داراً خيراً من داره ، وأهلاً خيراً من أهله وزوجاً خيراً من زوجه، وأدخله الجنة ،وأعذه من عذاب القبر ( ومن عذاب النار ) ",
      "اللهم اغفر لحينا وميتنا ، وشاهدنا وغائبنا ، وصغيرنا وكبيرنا ، وذكرنا وأُنثانا ، اللهم من أحييته منا فأحيه على الإسلام ، ومن توفيته منا فتوفه على الإيمان ، اللهم لا تحرمنا أجره ولا تضلنا بعده ",
      "اللهم إن فلان بن فلان في ذمتك،وحبل جوارك،فقه من فتنة القبر وعذاب النار،وأنت أهل الوفاء والحق .فاغفر له وارحمهُ إنك أنت الغفور الرحيم ",
      "اللهم عبدك وابن عبدك وابن أمتك احتاج إلى رحمتك ،وأنت غني عن عذابه،إن كان مُحسناً فزده في حسناته، وإن كان مُسيئاً فتجاوز عنه "
    ],
    "footnote": [
      "مسلم 2/663",
      "ابن ماجه 1/480 وأحمد 2/368 وانظر صحيح ابن ماجة1/ 251",
      "أخرجه ابن ماجه ، وانظر صحيح ابن ماجة1/ 251ورواه أبو داود 3/211",
      "أخرجه الحاكم وصححه ووافقه الذهبي 1/359 وانظر أحكام الجنائز للألباني ص125"
    ]
  },
  "الدعاء للفرط في الصلاة عليه": {
    "text": [
      "اللهم أعذه من عذاب القبر ",
      "أن قال : اللهم اجعله فرطاً وذخراً لوالديه ،وشفيعاً مجاباً .اللهم ثقل به موازينها وأعظم به أجورهما ، وألحقهُ بصالح المؤمنين ، واجعلهُ في كفالة إبراهيم ، وقه برحمتك عذاب الجحيم ، وأبدله داراً خيراً من داره ، وأهلاً خيراً من أهله ، اللهم اغفر لاسلافنا ، وأفراطنا ، ومن سبقنا بالإيمان  فحسن ",
      "اللهم اجعله لنا فرطاً ،وسلفاً وأجراً "
    ],
    "footnote": [
      "قال سعيد بن المسيب صليت وراء أبي هريرة على صبي لم يعمل خطيئة قط فسمعته يقول ... الحديث .أخرجه مالك في الموطأ 1/288 وابن أبي شيبه في المصنف 3/ 217 والبيهقي 4/9، وصحح إسناده شعيب الأرناؤوط في تحقيقه لشرح السنة للبغوي 5/357",
      "انظر : المغني لابن قدامة 3/416 والدروس المهمة لعامة الأمة للشيخ عبد العزيز بن عبد الله بن باز حفظه الله ص15",
      "كان الحسن يقرأ على الطفل بفاتحة الكتاب ويقول ..  الحديث أخرجه البغوي في شرح السنة 5/357وعبد الرزاق برقم 6588، وعلقه البخاري في كتاب الجنائز ، 65باب قراءة فاتحة الكتاب على الجنازة 2/113"
    ]
  },
  "دعاء التعزية": {
    "text": [
      "إن لله ما أخذ وله ما أعطى . وكل شيء عنده بأجل مُسمى ...فلتصبر ولتحتسب ",
      "وإن قال :  أعظم الله أجرك ،وأحسن عزاءك وغفر لميتك  فحسن "
    ],
    "footnote": ["البخاري 2/80 ومسلم 2/636", "الأذكار للنووي ص126"]
  },
  "الدعاء عند إدخال الميت القبر": {
    "text": ["بسم الله وعلى سُنة رسول الله "],
    "footnote": [
      "أبو داود 3/314بسند صحيح وأحمد بلفظ بسم الله وعلى ملة رسول الله وسنده صحيح"
    ]
  },
  "الدعاء بعد دفن الميت": {
    "text": ["اللهم اغفر له اللهم ثبته "],
    "footnote": [
      "كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت وقف عليه فقال : استغفروا لأخيكم وسلوا له التثبيت فإنه الآن يُسأل .أبو داود 3/315 والحاكم وصححه ووافقه الذهبي 1/370"
    ]
  },
  "دعاء زيارة القبور": {
    "text": [
      "السلام عليكم أهل الديار ، من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون [ ويرحم الله المُستقدمين منا والمستأخرين ] أسأل الله لنا ولكم العافية "
    ],
    "footnote": [
      "سلمم2/671 ،وابن ماجه واللفظ له 1/494 عن بريدة رضي الله عنه ، وما بين المعكوفين من حديث عائشة رضي الله عنها عند مسلم 2/671"
    ]
  },
  "دعاء الريح": {
    "text": [
      "اللهم إني أسألك خيرها ، وأعوذ بك من شرها ",
      "اللهم إني أسألك خيرها ، وخير ما فيها ، وخير ما أُرسلت به ، وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به "
    ],
    "footnote": [
      "أخرجه أبو داود 4/326وابن ماجه 2/1228 وانظر  صحيح ابن ماجة2/ 305",
      "مسلم 2/616 والبخاري 4/76"
    ]
  },
  "دعاء الرعد": {
    "text": ["سبحان الذي يُسبح الرعد بحمده والملائكة من خيفته "],
    "footnote": [
      "كان عبد الله بن الزبير رضي الله عنهما إذا سمع الرعد ترك الحديث وقال :.... الموطأ 2/992 وقال الألباني صحيح الإسناد موقوفاً"
    ]
  },
  "من أدعية الاستسقاء": {
    "text": [
      "اللهم اسقنا غيثاً مغيثاً مريئاً مَريعاً نافعاً غير ضار ، عاجلاً غير آجل ",
      "اللهم أغثنا ، اللهم أغثنا ، اللهم أغثنا ",
      "اللهم اسق عبادك وبهائمك ، وانشر رحمتك وأحيي بلدك الميت "
    ],
    "footnote": [
      "أبو داود 1/303 وصححه الألباني في صحيح أبي داود1/ 216",
      "والبخاري 1/224 ،مسلم 2/613",
      "أبو داود 1/305 وحسنه الألباني في صحيح أبي داود1/ 218"
    ]
  },
  "الدعاء إذا نزل المطر": {
    "text": ["اللهم صيباً نافعاً "],
    "footnote": ["البخاري مع الفتح 2/518"]
  },
  "الذكر بعد نزول المطر": {
    "text": ["مُطرنا بفضل الله ورحمته "],
    "footnote": ["والبخاري 1/205 ،مسلم 1/83"]
  },
  "من أدعية الاستصحاء": {
    "text": [
      "اللهم حوالينا ولا علينا ، اللهم على الآكامِ والظرابِ وبُطون الأودية ، ومنابت الشجر "
    ],
    "footnote": ["والبخاري 1/224 ،مسلم 2/614"]
  },
  "دعاء رؤية الهلال": {
    "text": [
      "الله أكبر ،اللهم أهلِه علينا بالأمن والإيمان ، والسلامة والإسلام ،والتوفيق لما تحب ربنا وترضى ، ربنا وربك الله "
    ],
    "footnote": ["الترمذي 5/504 والدارمي بلفظه 1/336 وانظر صحيح الترمذي3/ 157"]
  },
  "الدعاء عند إفطار الصائم": {
    "text": [
      "ذَهبَ الظَّمأُ، وابتلَّت العروقُ وثَبَتَ الأجرُ إنْ شاء الله ",
      "اللهم إني أسألك برحمتك التي وسعت كل شيءٍ أن تغفر لي "
    ],
    "footnote": [
      "أخرجه أبي داود 2/306 وغيره وانظر صحيح الجامع 4/209",
      "أخرجه ابن ماجه 1/557 من دعاء عبد الله بن عمرو رضي الله عنهما ،وحسنه الحافظ في تخريج الأذكار انظر شرح الأذكار 4/342"
    ]
  },
  "الدعاء قبل الطعام": {
    "text": [
      "إذا أكل أحدكم الطعام فليقل: بِسم الله، فإن نسي في أوله فليقل: بِسمِ الله في أوله وآخره ",
      "من أطعمه الله الطعام فليقل: اللهم بارك لنا فيه وأطعمنا خيراً منه. ومن سقاه الله لبناً فليقل: اللهم بارك لنا فيه وزدنا منه "
    ],
    "footnote": [
      "أخرجه أبو داود 3/347 والترمذي 4/288 وانظر صحيح الترمذي2/ 167",
      "الترمذي 5/506 وانظر صحيح الترمذي3/ 158"
    ]
  },
  "الدعاء عند الفراغ من الطعام": {
    "text": [
      "الحمد لله الذي أطعمني هذا ،وزرقنيه ،من غير حول مني ولا قوة ",
      "الحمدُ لله حمداً كثيراً طيباً مباركاً فيهِ، غيْرَ [مَكْفيٍّ ولا] مُوَدَّع، ولا مُستَغنَى عَنْهُ ربّنا "
    ],
    "footnote": [
      "أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 3/159",
      "البخاري 6/‌214 والترمذي بلفظه 5/ 507"
    ]
  },
  "دعاء الضيف لصاحب الطعام": {
    "text": ["اللهُمَّ بَارِكْ لَهُم فيما رَزَقتهْمْ، واغْفِر لهم وارحَمْهُم "],
    "footnote": ["مسلم3/ 1626"]
  },
  "الدعاء لمن سقاه أو إذا أراد ذلك": {
    "text": ["اللهُمَّ أَطْعِمْ مَنْ أطْعَمَني وأَسْقِ مَنْ سْقَاني "],
    "footnote": ["مسلم3/ 26"]
  },
  "الدعاء إذا أفطر عند أهل بيت": {
    "text": [
      "أَفطَر عِنْدَكُم الصائِمونَ ، وأكل طعامَكُمُ الأبْرارُ ، وصلت عليكُمُ الملائِكَةُ "
    ],
    "footnote": [
      "سنن أبي داود 3/367، وابن ماجه 1/556 ،والنسائي في عمل اليوم والليلة برقم 298 ،ونص على أنه صلى الله عليه وسلم يقوله إذا أفطر عند أهل بيت ،وصححه الألباني في صحيح أبي داود 2/730"
    ]
  },
  "دعاء الصائم إذا حضر الطعام ولم يفطر": {
    "text": [
      "إذا دُعي أحدكم فليجب ، فإن كان صائماً فليصل وإن كان مفطراً فليطعم  ومعنى فليصل أي فليدع"
    ],
    "footnote": ["مسلم 2/1054"]
  },
  "ما يقول الصائم إذا سابه أحد": {
    "text": ["إني صائم ، إني صائم "],
    "footnote": ["البخاري مع الفتح 4/103 ،ومسلم 2/ 806"]
  },
  "الدعاء عند رؤية باكورة الثمر": {
    "text": [
      "اللهم بارك لنا في ثمرنا ، وبارك لنا في مدينتنا وبارك لنا في صاعنا ، وبارك لنا في مدنا "
    ],
    "footnote": ["مسلم 2/1000"]
  },
  "دعاء العطاس": {
    "text": [
      "إذا عطس أحدكم فليقل الحمد لله ،وليقل له أخوهُ أو صاحبهُ : يرحمك الله ،فإذا قال لهُ :يرحمك الله ،فليقل :يهديكم الله ويصلح بالكم "
    ],
    "footnote": ["البخاري 7/125"]
  },
  "ما يقالُ للكافر إذا عطس فحمد الله": {
    "text": ["يهديكم الله ويصلح بالكم "],
    "footnote": [
      "الترمذي 5/82 وأحمد 4/400 وأبو داود 4/308، وانظر صحيح الترمذي 2/354"
    ]
  },
  "الدعاء للمتزوج": {
    "text": ["بارك الله لك ، وبارك عليك ، وجمع بينكما في خير "],
    "footnote": ["أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 1/316"]
  },
  "دعاء المتزوج لنفسه ودعاء شراء الدابة": {
    "text": [
      "إذا تزوج أحدكم امرأة ،أو إذا اشترى خادماً فليقل : اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها وشر ما جبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك "
    ],
    "footnote": ["أبو داود 2/248 وابن ماجه 1/617 وانظر صحيح ابن ماجه 1/324"]
  },
  "الدعاء قبل إتيان الزوجة": {
    "text": ["بسم الله ، اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا "],
    "footnote": ["البخاري 6/141 ومسلم 2/1028"]
  },
  "دعاء الغضب": {
    "text": ["أعوذ بالله من الشيطان الرجيم "],
    "footnote": ["البخاري 6/99 ومسلم4/2015"]
  },
  "دعاء من رأى مبتلى": {
    "text": [
      "الحمد لله الذي عافاني مما ابتلاك به ، وفضلني على كثير ممن خلق تفضيلاً "
    ],
    "footnote": ["الترمذي 5/494 و5/493 وانظر  صحيح الترمذي3/ 153"]
  },
  "ما يقال في المجلس": {
    "text": [
      "عن ابن عمر قال : كان يعد لرسول الله صلى الله عليه وسلم في المجلس الواحد مائة مرة من قبل أن يقوم رب اغفر لي وتب علي إنك أنت التواب الغفور "
    ],
    "footnote": [
      "الترمذي وغيره وانظر صحيح الترمذي 3/153 وصحيح ابن ماجه 2/321 ولفظه للترمذي"
    ]
  },
  "كفارة المجلس ومايختم به المجالس": {
    "text": [
      "سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك "
    ],
    "footnote": [
      "أخرجه أصحاب السنن وانظر صحيح الترمذي 3/153، وقد ثبت عن عائشة رضي الله عنها قالت :ما جلس رسول الله صلى الله عليه وسلم مجلساً ، ولاتلى قرآناً ، ولا صلاة إلا ختم ذلك بكلمات.... الحديث أخرجه النسائي في عمل اليوم والليلة برقم 308 ، وأحمد 6/77 وصححه الدكتور فاروق حمادة في تحقيقه لعمل اليوم والليلة للنسائي ص273"
    ]
  },
  "الدعاء لمن قال غفر الله لك": {
    "text": ["ولك "],
    "footnote": [
      "أحمد 5/28 والنسائي في عمل اليوم والليلة ص218برقم 421 تحقيق الدكتور فاروق حمادة"
    ]
  },
  "الدعاء لمن صنع إليك معروفاً": {
    "text": ["جَزَاكَ الله خيراً "],
    "footnote": [
      "أخرجه الترمذي رقم 2035 وانظر صحيح الجامع 6244 وصحيح الترمذي2/ 200"
    ]
  },
  "ما يعصم به من الدجال": {
    "text": [
      "من حفظ عشر آيات من أول سورة الكهف عصم من الدجال  والاستعاذة بالله من فتنتة عقب التشهد الأخير من كل صلاة "
    ],
    "footnote": [
      "مسلم 1/555 وفي رواية من آخر الكهف 1/556",
      "انظر حديث رقم 55 وحديث 56"
    ]
  },
  "الدعاء لمن قال إني أحبك في الله": {
    "text": ["أحبك الذي أحببتني له ُ "],
    "footnote": [
      "أخرجه أبو داود 4/333، وحسنه الألباني في صحيح سنن أبي داود 3/965"
    ]
  },
  "الدعاء لمن عرض عليك ماله": {
    "text": ["بارك الله لك في أهلك ومالك "],
    "footnote": ["البخاري الفتح4/ 88"]
  },
  "الدعاء لمن أقرض عند القضاء": {
    "text": ["بارك الله لك في أهلك ومالك إنما جزاء السلف الحمد والأداء "],
    "footnote": [
      "أخرجه النسائي في عمل اليوم والليلة ص 300 وابن ماجه 2/ 809 وانظر صحيح ابن ماجه 2/809 وانظر صحيح ابن ماجه 2/55"
    ]
  },
  "دعاء الخوف من الشرك": {
    "text": ["اللهم إني أعوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم "],
    "footnote": [
      "أحمد 4/403 وغيره وانظر صحيح الجامع 3/333 وصحيح الترغيب والترهيب للألباني"
    ]
  },
  "الدعاء لمن قال بارك الله فيك": {
    "text": ["وفيك بارك الله "],
    "footnote": [
      "أخرجه ابن السني ص138 برقم 278 وانظر الوابل الصيب لابن القيم 304 تحقيق بشير محمد عيون"
    ]
  },
  "دعاء كراهية الطيرة": {
    "text": ["اللهم لا طير إلا طيرك ، ولا خير إلا خيرك ،ولا إله غيرك "],
    "footnote": [
      "أحمد 2/220 وابن السني برقم 292 وصححه الألباني في الأحاديث الصحيحة 3/54 رقم 1065 ، أما الفأل فكان يعجب النبي صلى الله عليه وسلم ؛ ولهذا سمع من رجل كلمة طيبة فأعجبته فقال : أخذنا فألك من فيك  أبو داود وأحمد ،وصححه الألباني في الصحيحة2/363 عند أبي الشيخ في أخلاق النبي"
    ]
  },
  "دعاء ركوب الدابة": {
    "text": [
      "بسم الله. الحمد لله. {سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ} الحمد لله ، الحمد لله ، الحمد لله ، الله اكبر ، الله اكبر ، الله اكبر ، سبحانك اللهم إني ظلمت نفسي فاغفر لي ، فإنه لا يغفر الذنوب إلا أنت "
    ],
    "footnote": ["أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 156"]
  },
  "دعاء السفر": {
    "text": [
      "الله أكبر، الله أكبر، الله أكبر،{سُبْحانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ}  اللهم إنا نسألُكَ في سفرنا هذا البرَّ والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا واطو عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعْثاءِ السفر، وكآبة المنظر وسوء المنقلب في المال والأهل وإذا رجع قالهن وزاد فيهن آيبون، تائبون، عابدون، لربنا حامدون "
    ],
    "footnote": ["رواه مسلم2/ 978"]
  },
  "دعاء دخول القرية أو البلدة": {
    "text": [
      "اللهم رب السموات السبع وما أظللن ، ورب الأرضين السبع وما أقللن ،ورب الشياطين وما أضللن ، ورب الرياح وما ذرين.أسألك خير هذه القرية وخير أهلها ، وخير ما فيها،وأعوذ بك من شرها،وشر أهلها ، وشر ما فيها "
    ],
    "footnote": [
      "الحاكم وصححه ووافقه الذهبي 2/100 وابن السني برقم 524وحسنه الحافظ في تخريج الأذكار 5/154 قال ابن باز:ورواه النسائي بإسناد حسن . انظر تحفة الأخيار ص 37"
    ]
  },
  "دعاء دخول السوق": {
    "text": [
      "لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد ، يُحيي ويُميت ، وهو حي لا يموت ، بيده الخير وهو على كل شئ قدير "
    ],
    "footnote": [
      "الترمذي 5/491 والحاكم 1/538 وحسنه الألباني في صحيح ابن ماجه 2/21 وفي صحيح الترمذي3/ 152"
    ]
  },
  "الدعاء إذا تعس المركوب": {
    "text": ["بسم الله "],
    "footnote": ["أبو داود 4/296 وصححه الألباني في صحيح أبي داود 3/941"]
  },
  "دعاء المسافر للمقيم": {
    "text": ["أستودعُكَ الله الذي لا تضيع ودائعه "],
    "footnote": ["أحمد 2/403 وابن ماجه 2/943 وانظر صحيح ابن ماجة2/ 133"]
  },
  "دعاء المقيم للمسافر": {
    "text": [
      "أستودع الله دينك وأمانتك ،وخواتيم عملك ",
      "زوَّدك الله التقوى، وغفر ذْنبك ويسَّر لك الخير حيث ما كنت "
    ],
    "footnote": [
      "أحمد 2/7 الترمذي5/499  وانظر صحيح الترمذي3/ 155",
      "الترمذي وانظر صحيح الترمذي3/ 155"
    ]
  },
  "التكبير والتسبيح في سير السفر": {
    "text": [
      "قال جابر رضي الله عنه :  كنا إذا صعدنا كبرنا ، وإذا نزلنا سبحنا "
    ],
    "footnote": ["البخاري الفتح6/ 135"]
  },
  "دعاء المسافر إذا أسحر": {
    "text": [
      "سَمعَ سَامعً بحمد الله وحُسنِ بلائه علينا، ربنا صاحبنا ، وأفضِل علينا عائذا بالله من النار "
    ],
    "footnote": [
      "مسلم4/ 2086 ومعني سمع سامع : أي شهد شاهد على حمدنا لله تعالى على نعمه وحسن بلائه . ومعني سمع سامع : بلغ سامع قولي هذا لغيره وقال مثله تنبيهاً على الذكر في السحر والدعاء . وقوله : ربنا صاحبنا وأفضل علينا : أي احفظنا وحطنا واكلأنا وأفضل علينا بجزيل نعمك واصرف عنا كل مكروه ، شرح النووي 17/39"
    ]
  },
  "الدعاء إذا نزل منزلا في سفر أو غيره": {
    "text": ["أعوذ بكلمات الله التامات من شر ما خلق "],
    "footnote": ["رواه مسلم4/2080"]
  },
  "ذكر الرجوع من السفر": {
    "text": [
      "يكبر على كل شرف ثلاث تكبيرات ثم يقول : لا إله إلا الله وحده لا شريك لهُ ،لهُ الملك ، ولهُ الحمدُ وهو على كل شيءٍ قدير ، آيبون ،تائبون ، عابدون ، لربنا حامدون ،صدق الله وعده،ونصر عبده،وهزم الأحزاب وحده "
    ],
    "footnote": [
      "كان النبي صلى الله عليه وسلم يقوله إذا قفل من غزو أو حج ، البخاري 7/163 ومسلم 2/ 980"
    ]
  },
  "ما يقول ويفعل من أتاه أمر يسره أو يكرهه": {
    "text": [
      "كان صلى الله عليه وسلم إذا أتاه الأمر يسره قال : الحمد لله الذي بنعمته تتم الصالحات  و إذا أتاه أمر يكرهه قال :  الحمد لله على كل حال "
    ],
    "footnote": [
      "أخرجه ابن السني في عمل اليوم والليلة والحاكم وصححه 1/499 وصححه الألباني في صحيح الجامع 4/ 201"
    ]
  },
  "فضل الصلاة على النبي صلى الله عليه وسلم": {
    "text": [
      "قال صلى الله عليه وسلم  من صلى علي صلاة صلى الله عليه بها عشراً ",
      "وقال صلى الله عليه وسلم :  لا تجعلوا قبري عيداً وصلوا علي ؛ فإن صلاتكم تبلغني حيث كنتم ",
      "وقال صلى الله عليه وسلم :  البخيل من ذكرت عندهُ فلم يصل علي ",
      "وقال صلى الله عليه وسلم  إن لله ملائكة سياحين في الأرض يبلغوني من أمتي السلام ",
      "وقال صلى الله عليه وسلم  ما من أحدٍ يسلِّمُ عليَّ إلَّا ردَّ اللَّهُ عليَّ روحي حتَّى أردَّ عليْهِ السَّلامَ "
    ],
    "footnote": [
      "أخرجه مسلم 1/288",
      "أبو داود 2/218 وأحمد 2/367 وصححه الألباني في صحيح أبي داود 2/ 383",
      "الترمذي 5/551 وغيره وانظر صحيح الجامع 3/ 25 وصحيح الترمذي 3/ 177",
      "النسائي ،والحاكم 2/421 وصححه الألباني في صحيح النسائي 1/274",
      "أبو داود برقم 2041وحسنه الألباني في صحيح أبي داود 1/ 383"
    ]
  },
  "إفشاء السلام": {
    "text": [
      "قال رسول الله صلى الله عليه وسلم : لا تدخلوا الجنة حتى تؤمنوا ، ولا تؤمنوا حتى تحابوا ، أو لا أدلكم على شيءٍ إذا فعلتموه تحاببتم ، أفشوا السلام بينكم ",
      "ثلاث من جمعهن فقد جمع الإيمان : الإنصاف من نفسك ، وبذل السلام للعالم ،والإنفاق من الإقتار ",
      "وعن عبد الله بن عمر رضي الله عنهما : أن رجلاً سأل النبي صلى الله عليه وسلم أي الإسلام خير قال : تطعم الطعام وتقرأ السلام على من عرفت ومن لم تعرف "
    ],
    "footnote": [
      "مسلم 1/74 وغيره",
      "البخاري مع الفتح 1/ 82 عن عمار رضي الله عنه موقوفاً معلقاً",
      "البخاري مع الفتح 1/55 ومسلم 1/65"
    ]
  },
  "كيف يرد السلام على الكافر إذا سلم": {
    "text": ["إذا سلم عليكم أهل الكتاب فقولوا :  وعليكم "],
    "footnote": ["البخاري مع الفتح11/42 ،ومسلم 4/1705"]
  },
  "دعاء صياح الديك ونهيق الحمار": {
    "text": [
      "إذا سمعتم صياح الديكة ، فاسألوا الله من فضله فإنها رأت ملكاً وإذا سمعتم نهيق الحمار ، فتعوذوا بالله من الشيطان فإنه رأى شيطاناً "
    ],
    "footnote": ["البخاري مع الفتح6/350 ،ومسلم 4/2092"]
  },
  "دعاء نباح الكلاب بالليل": {
    "text": [
      "إذا سمعتم نُباح الكلاب ونهيق الحمير بالليل فتعوذوا بالله منهن فإنهن يرين ما لا ترون "
    ],
    "footnote": [
      "أبو داود 4/ 327 وأحمد 3/ 306 وصححه الألباني في صحيح أبي داود3/ 961"
    ]
  },
  "الدعاء لمن سببته": {
    "text": [
      "قال صلى الله عليه وسلم:  اللَّهُم فأيما مؤمن سببته فاجعل ذلك له قربة إليك يوم القيامة "
    ],
    "footnote": [
      "البخاري مع الفتح 11/ 171 و مسلم4/ 2007 ولفظه فاجعلها له زكاة ورحمة"
    ]
  },
  "ما يقول المسلم إذا مدح المسلم": {
    "text": [
      "قال صلى الله عليه وسلم :  إذا كان أحدكم مادحاً صاحبه لا محالة فليقل : أحسبُ فلاناً والله حسيبهُ ولا أزكي على الله أحداً ، أحسبهُ – إن كان يعلم ذاك – كذا وكذا "
    ],
    "footnote": ["رواه مسلم 4/2296"]
  },
  "ما يقول المسلم إذا زكي": {
    "text": [
      "اللهم لا تؤاخذني بما يقولون ، واغفر لي مالا يعلمون [واجعلني خيراً مما يظنون] "
    ],
    "footnote": [
      "البخاري في الأدب المفرد برقم 761 ، وصحح إسناده الألباني في صحيح الأدب المفرد برقم 585 ، وما بين المعكوفين زيادة للبيهقي في شعب الإيمان 4/ 228 من طريق آخر"
    ]
  },
  "كيف يلبي المحرم في الحج أو العمرة": {
    "text": [
      "لبيك اللهم لبيك ، لبيك لا شريك لك لبيك ، إن الحمد والنعمة لك والملك ، لا شريك لك "
    ],
    "footnote": ["البخاري مع الفتح 3/ 408 ، ومسلم 2/841"]
  },
  "التكبيرة إذا أتي الركن الأسود": {
    "text": [
      "طاف النبي صلى الله عليه وسلم بالبيت على بعير كلما أتي الركن أشار إليه بشيء عنده وكبر "
    ],
    "footnote": [
      "البخاري مع الفتح 3/476 ،والمراد بالشيء المحجن انظر : البخاري مع الفتح 3/472"
    ]
  },
  "الدعاء بين الركن اليماني والحجر الأسود": {
    "text": [
      "{ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ} "
    ],
    "footnote": [
      "أبو داود 2/ 179 وأحمد 3/411 والبغوي في شرح السنة 7/128 ،وحسنه الألباني في صحيح أبي داود 1/ 354 ، والآية من سورة البقرة ، 201"
    ]
  },
  "دعاء الوقوف على الصفا والمروة": {
    "text": [
      "فلما دنا صلى الله عليه وسلم من الصفا قرأ: { إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَآئِرِ اللّهِ }  أبدأ بما بدأ الله به  فبدأ بالصفا فرقي عليه حتى رأى البيت فاستقبل القبلة ، فوحد الله وكبره وقال :  لا إله إلا الله وحده لا شريك لهُ ، لهُ الملك ولهُ الحمد وهو على كل شيءٍ قدير ، لا إله إلا الله وحده ، أنجز وعده ، ونصر عبده ، وهزم الأحزاب وحده  ثم دعا بين ذلك . قال مثل هذا ثلاث مرات  الحديث وفيه  ففعل على المروة كما فعل على الصفا "
    ],
    "footnote": ["مسلم 2/888"]
  },
  "الدعاء يوم عرفة": {
    "text": [
      "خير الدعاء دعاء يوم عرفة ، وخيرُ ما قلت أنا والنبيُّون من قبلي : لا إله إلا الله وحدهُ لا شريك لهُ ، لهُ الملكُ ولهُ الحمدُ وهو على كل شيء قدير "
    ],
    "footnote": [
      "الترمذي وحسنه الألباني في صحيح الترمذي 3/184، وفي الحديث الصحيحة 4/6"
    ]
  },
  "الذكر عند المشعر الحرام": {
    "text": [
      "ركب صلى الله عليه وسلم القصواء حتى أتى المشعر الحرام فاستقبل القبلة ( فدعاه ُ، وكبرهُ ،وهللهُ ، ووحدهُ) فلم يزل واقفاً حتى أسفر جداً فدفع قبل أن تطلع الشمس "
    ],
    "footnote": ["مسلم 2/891"]
  },
  "التكبيرة عند رمي الجمار مع كل حصاة": {
    "text": [
      "يكبر كلما رمى بحصاة عند الجمار الثلاث ثم يتقدم، ويقف يدعو مستقبل القبلة، رافعاً يديه بعد الجمرة الأولى والثانية، أما جمرة العقبة فيرميها ويكبر عند كل حصاة وينصرف ولا يقف عندها "
    ],
    "footnote": [
      "البخاري مع الفتح 3/583 و3/584 وانظر لفظه هناك . والبخاري مع الفتح 3/581 ورواه مسلم أيضاً"
    ]
  },
  "ما يقول عند التعجب والأمر السار": {
    "text": ["سبحان الله ", "الله أكبر "],
    "footnote": [
      "البخاري مع الفتح 1/210 و390 و414 ومسلم 4/ 1857",
      "البخاري الفتح8/ 441 وانظر صحيح الترمذي 2/103 و2/235 ومسند أحمد 5/ 218"
    ]
  },
  "ما يفعل من أتاه أمر يسره": {
    "text": [
      "كان النبي صلى الله عليه وسلم إذا أتاه أمر يسرهُ أو يسرُّ به خر ساجداً شكراً لله تبارك وتعالى "
    ],
    "footnote": [
      "رواه أهل السنن إلا النسائي . انظر صحيح ابن ماجه 1/ 233 وإرواء الغليل 2/226"
    ]
  },
  "ما يقول من أحس وجعاً في جسده": {
    "text": [
      "ضع يدك على الذي تألم من جسدك وقل: بسم الله ، ثلاثاً  وقل سبع مرات :  أعوذ بالله وقدرته من شر ما أجد وأحاذر "
    ],
    "footnote": ["مسلم 4/1728"]
  },
  "دعاء من خشي أن يصيب شيئاً بعينه": {
    "text": [
      "إذا رأى أحدكم من أخيه ، أو من نفسه ، أومن ماله ما يعجبهُ [فليدع لهُ بالبركة ] فإن العين حقٌّ "
    ],
    "footnote": [
      "مسند أحمد 4/447 وابن ماجه ومالك ، وصححه الألباني في صحيح الجامع 1/212 وانظر تحقيق زاد المعاد للأرناؤوط 4/170"
    ]
  },
  "ما يقال عند الفزع": {
    "text": ["لا إله إلا الله "],
    "footnote": ["البخاري مع الفتح 6/ 181 ، ومسلم 4/ 2208"]
  },
  "ما يقول عند الذبح أو النحر": {
    "text": ["بسم الله والله أكبر [ اللهم منك ولك ] اللهم تقبل مني "],
    "footnote": [
      "مسلم 3/1557 والبيهقي 9/287 وما بين المعكوفين للبيهقي 9/287 وغيره والجملة الأخيرة سقتها بالمعنى من رواية مسلم"
    ]
  },
  "ما يقول لرد كيد مردة الشياطين": {
    "text": [
      "أعوذ بكلمات الله التامات التي لا يجاوزهن بر ولا فاجر من شر ما خلق ، وبرأ وذرأ ومن شر ما ينزل من السماء ، ومن شر ما يعرج فيها ، ومن شر ما ذرأ في الأرض ، ومن شر ما يخرج منها ، ومن شر فتن الليل والنهار ، ومن شر كل طارق إلا طارقاً يطرق بخير يا رحمن "
    ],
    "footnote": [
      "أحمد 3/419 بإسناد صحيح وابن السني برقم 637 وصحح إسناده الأرناؤوط في تخريجه للطحاوية ص 133 وانظر مجمع الزوائد 10/ 127"
    ]
  },
  "الاستغفار والتوبة": {
    "text": [
      "قال رسول الله صلى الله عيه وسلم : والله إني لاستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة  ",
      "وقال صلى الله عيه وسلم : يا أيها الناس توبوا إلى الله فإني أتوب في اليوم إليه مائة مرةً ",
      "وقال صلى الله عيه وسلم : من قال أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه ، غفر الله لهُ وإن كان فر من الزحف ",
      "وقال صلى الله عيه وسلم : أقرب ما يكون الربُّ من العبد في جوف الليل الآخر فإن استطعت أن تكون ممن يذكر الله في تلك الساعة فكن ",
      "وقال صلى الله عيه وسلم : أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء ",
      "وقال صلى الله عيه وسلم : إنه ليغان على قلبي وإني لاستغفرُ الله في اليوم مائة مرة "
    ],
    "footnote": [
      "البخاري مع الفتح 11/101",
      "مسلم 4/2076",
      "أخرجه أبو داود 2/85 والترمذي 5/569 والحاكم وصححه ووافقه الذهبي 1/511 وصححه الألباني . انظر صحيح الترمذي 3/182 وجامع الأصول لأحاديث الرسول صلى الله عيه وسلم 4/389 – 390 بتحقيق الأرناؤوط",
      "أخرجه الترمذي والنسائي 1/279 والحاكم وانظر صحيح الترمذي 3/183 وجامع الأصول بتحقيق الأرناؤوط 4/144",
      "مسلم 1/350",
      "أخرجه مسلم 4/2075 قال ابن الأثير : ( ليُغان على قلبي ) أي ليغطى ويغشى والمراد : السهو ؛ لأنه كان صلى الله عيه وسلم لا يزال في مزيد من الذكر والقربة ودوام المراقبة فإذا سها عن شيء منها في بعض الأوقات ،أو نسي ،عدهُ ذنباً على نفسه ففزع إلى الاستغفار . انظر جامع الأصول 4/386"
    ]
  },
  "فضل التسبيح والتحميد ، والتهليل ، والتكبير": {
    "text": [
      "قال صلى الله عيه وسلم من قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه ولو كانت مثل زبد البحر ",
      "وقال صلى الله عيه وسلم : من قال لا إله إلا وحده لا شريك لهُ ، لهُ الملك ، ولهُ الحمدُ ، وهو على كل شيء قدير عشر مرات . كان كمن أعتق أربعة أنفس من ولد إسماعيل ",
      "وقال صلى الله عيه وسلم : كلمتان خفيفتان على اللسان ، ثقيلتان في الميزان حبيبتان إلى الرحمن : سبحان الله وبحمده سبحان الله العظيم ",
      "وقال صلى الله عيه وسلم  : لأن أقول سبحان الله ، والحمد لله ،ولا إله إلا الله ، والله أكبر ،أحب إلى مما طلعت عليه الشمس ",
      "وقال صلى الله عيه وسلم: أيعجز أحدكم أن يكسب كل يوم ألف حسنةفسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة ؟ قال : يسبح مائة تسبيحة ، فيكتب له ألف حسنة أو يحط عنه ُ ألف خطيئة ",
      "من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة ",
      "وقال صلى الله عيه وسلم: يا عبد الله بن قيس ألا أدلك على كنز من كنوز الجنة ؟ فقلت:بلى يا رسول الله ، قال : قل لا حول ولا قوة إلا بالله ",
      "وقال صلى الله عيه وسلم: أحب الكلام إلى الله أربعٌ : سبحان الله ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، لا يضرك بأيهنَّ بدأت ",
      "جاء أعرابي إلى رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فقال: علمني كلاماً أقوله : قال  قل لا إله إلا الله وحده لا شريك لهً ،الله أكبرُ كبيراً ، والحمد لله كثيراً ، سبحان الله رب العالمين ،لا حول ولا قوة إلا بالله العزيز الحكيم  قال فهؤلاء لربي فما لي ؟ قال :  قل: اللهم اغفر لي ،وارحمني ،واهدني وارزقني ",
      "كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم الصلاة ثم أمره أن يدعو بهؤلاء الكلمات : اللهم اغفر لي، وارحمني ،واهدني ، وعافني وارزقني ",
      "إن أفضل الذكر لا إله إلا الله  ",
      "الباقيات الصالحات : سبحان الله والحمد لله ، ولا إله إلا الله ،والله أكبر ،و لا حول ولا قوة إلا بالله "
    ],
    "footnote": [
      "البخاري 7/168 ومسلم 4/ 2071 ، وانظر :فضل من قالها مائة مرة إذا أصبح وإذا أمسى",
      "البخاري 7/67 ومسلم بلفظه 4/2071 وانظر فضل من قالها في اليوم مائة مرة",
      "البخاري 7/167ومسلم 4/2072",
      "مسلم 4/2072",
      "مسلم 4/2073",
      "أخرجه الترمذي 5/511 والحاكم 1/501 وصححه ووافقه الذهبي ، وانظر صحيح الجامع 5/531 وصحيح الترمذي 3/160",
      "البخاري مع الفتح 11/ 213 ومسلم 4/2076",
      "مسلم 3/1685",
      "مسلم 4/ 2072 وزاد أبو داود : فلما ولى الأعرابي قال النبي صلى الله عليه وسلم : لقد ملأ يديه من الخير 1/ 220",
      "مسلم 4/2073 وفي رواية لمسلم  فإن هؤلاء تجمع لك ديناك وآخرتك",
      "الترمذي 5/462 وابن ماجه 2/1249 والحاكم 1/503 وصححه ووافقه الذهبي وانظر صحيح الجامع 1/ 362",
      "أحمد برقم 513 بترتيب أحمد شاكر وإسناده صحيح وانظر مجمع الزوائد 1/297، وعزاه ابن حجر في بلوغ المرام من رواية أبي سعيد إلىالنسائي وقال :صححه ابن حبان والحاكم"
    ]
  },
  "كيف كان النبي صلى الله عليه وسلم يسبح ؟": {
    "text": [
      "عن عبد الله بن عمرو رضي الله عنهما قال :  رأيت النبي صلى الله عليه وسلم يعقد التسبيح بيمينه "
    ],
    "footnote": [
      "أخرجه أبو داود بلفظه 2/81 والترمذي 5/521 وانظر صحيح الجامع 4/271 برقم 4865"
    ]
  },
  "من أنواع الخير والآداب الجامعة": {
    "text": [
      "إذا كان جنح الليل – أو أمسيتم – فكفوا صبيانكم ؛ فإن الشياطين تنتشر حينئذ ، فإذا ذهب ساعة من الليل فخلوهم ،وأغلقوا الأبواب واذكروا اسم الله ؛ فإن الشيطان لا يفتح باباً مغلقاً ، وأوكوا قربكم واذكروا اسم الله ، وخمروا آنيتكم واذكروا اسم الله ، ولو أن تعرضوا عليها شيئاً ، وأطفئوا مصابيحكم "
    ],
    "footnote": ["البخاري مع الفتح 10/ 88 ومسلم 3/1595"]
  }
};
