List ruqiaText = [
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿1﴾ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ﴿2﴾ الرَّحْمَنِ \r\nالرَّحِيمِ ﴿3﴾ مَالِكِ يَوْمِ الدِّينِ ﴿4﴾ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ \r\nنَسْتَعِينُ ﴿5﴾ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ﴿6﴾ صِرَاطَ الَّذِينَ \r\nأَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ﴿7﴾."
  },
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "الم ﴿1﴾ ذَلِكَ الْكِتَابُ لَا رَيْبَ \r\nفِيهِ هُدًى لِلْمُتَّقِينَ ﴿2﴾ الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ \r\nالصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ ﴿3﴾ وَالَّذِينَ يُؤْمِنُونَ بِمَا \r\nأُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآَخِرَةِ هُمْ يُوقِنُونَ \r\n﴿4﴾ أُولَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ ﴿5﴾."
  },
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ \r\nالْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي \r\nالسَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ \r\nبِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ \r\nبِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ \r\nوَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ."
  },
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "لِلَّهِ مَا فِي السَّمَاوَاتِ \r\nوَمَا فِي الْأَرْضِ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ \r\nيُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ \r\nوَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ﴿284﴾ آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ \r\nإِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ \r\nوَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا \r\nسَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ﴿285﴾ لَا \r\nيُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا \r\nاكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا \r\nوَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا \r\nرَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ \r\nلَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ \r\n﴿286﴾."
  },
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "قُلْ يَا أَيُّهَا الْكَافِرُونَ ﴿1﴾ لَا أَعْبُدُ مَا تَعْبُدُونَ ﴿2﴾ وَلَا \r\nأَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿3﴾ وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ ﴿4﴾ \r\nوَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿5﴾ لَكُمْ دِينُكُمْ وَلِيَ دِينِ ﴿6﴾."
  },
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "قُلْ هُوَ اللَّهُ أَحَدٌ ﴿1﴾ اللَّهُ الصَّمَدُ ﴿2﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ \r\n﴿3﴾ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ﴿4﴾."
  },
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿1﴾ \r\nمِنْ شَرِّ مَا خَلَقَ ﴿2﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿3﴾ وَمِنْ شَرِّ \r\nالنَّفَّاثَاتِ فِي الْعُقَدِ ﴿4﴾ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿5﴾."
  },
  {
    "category": "الرُّقية الشرعية من القرآن الكريم",
    "count": "",
    "description": "",
    "reference": "",
    "zekr":
        "قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿1﴾ \r\nمَلِكِ النَّاسِ ﴿2﴾ إِلَهِ النَّاسِ ﴿3﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿4﴾ \r\nالَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿5﴾ مِنَ الْجِنَّةِ وَالنَّاسِ ﴿6﴾."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "فإذا قالَ ذلكَ قال الشيطانُ : حُفِظَ منِّي سائرَ اليومِ",
    "reference": "أبو داود",
    "zekr":
        "أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "الترمذي",
    "zekr":
        "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "البخاري",
    "zekr":
        "أعوذُ بكلماتِ اللهِ التامَّةِ ، مِن كُلِّ شيطانٍ وهامَّةٍ ، ومِن كُلِّ عَيْنٍ لامَّةٍ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "مسلم",
    "zekr": "أعوذُ بكلماتِ اللهِ التامَّاتِ مِن شرِّ ما خَلق."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "مسلم",
    "zekr":
        "بِسْمِ اللَّهِ أَرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ، اللَّهُ يَشْفِيكَ، بِسْمِ اللَّهِ أَرْقِيكَ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "مسلم",
    "zekr":
        "بِسْمِ اللَّهِ (ثَلَاثًا)، أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ (سَبْعَ مَرَّاتٍ)."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "7",
    "description": "",
    "reference": "أحمد",
    "zekr":
        "أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يَشْفِيَكَ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "البخاري",
    "zekr":
        "اللَّهُمَّ ربَّ النَّاسِ، أَذْهِب الْبَأسَ، واشْفِ، أَنْتَ الشَّافي لا شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفاءً لا يُغَادِرُ سقَماً."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "أحمد",
    "zekr": "اللَّهُمَّ اشْفِ عَبْدَكَ، وصَدِّقْ رَسُولَك."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "أحمد",
    "zekr":
        "اللهُمَّ بَارِكْ عَلَيْهِ، وَأَذْهِبْ عَنْهُ حَرَّ الْعَيْنِ وَبَرْدَهَا وَوَصَبَهَا."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "الترمذي",
    "zekr":
        "اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صلى الله عليه وسلم وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صلى الله عليه وسلم وَأَنْتَ الْمُسْتَعَانُ، وَعَلَيْكَ الْبَلَاغُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "أحمد\n",
    "zekr":
        "لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْكَرِيمِ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْعَرْشِ الْعَظِيمِ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "3",
    "description": "",
    "reference": "أبو داود",
    "zekr":
        "رَبّنَا الَّلهُ الذِي فِي السَّمَاءِ، تَقَدَّسَ اسمُكَ، أَمرُكَ فِي السَّمَاءِ وَالأَرْضِ، كَمَا رَحمَتُكَ فِي السَّمَاءِ فَاجْعَلْ رَحْمَتَكَ فِي الأَرْضِ، اغفِر لَنَا حَوْبَنَا وَخَطَايَانَا، أَنتَ رَبُّ الطَّيِّبِينَ، أَنزِلْ رَحْمَةً مِن رَحمَتِكَ، وَشِفَاءً مِن شِفَائِكَ عَلَى هَذَا الوَجَعِ، فَيَبرَأ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "أحمد\n",
    "zekr":
        "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَلَا فَاجِرٌ، مِنْ شَرِّ مَا خَلَقَ، وَبَرَأَ، وَذَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "3",
    "description": "",
    "reference": "أبو داود",
    "zekr":
        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "أبو داود",
    "zekr":
        "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ غَضَبِهِ وَعِقَابِهِ ، وَشَرِّ عِبَادِهِ ، وَمَنْ هَمَزَاتِ الشَّيَاطِينِ ، وَأَنْ يَحْضُرُونِ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "الترمذي",
    "zekr":
        "بِسْمِ اللَّهِ الْعَظِيمِ ، أَعُوذُ بِاللَّهِ الْكَبِيرِ مِنْ شَرِّ كُلِّ عِرْقٍ نَعَّارٍ ، وَمِنْ شَرِّ حَرِّ النَّارِ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "البخاري\n",
    "zekr":
        "بِسْمِ اللهِ تربَةُ أَرْضِنَا، بِرِيقةِ بَعْضِنَا، يُشْفَى سَقِيمُنَا، بإِذْنِ رَبِّنَا."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "7",
    "description": "",
    "reference": "أحمد",
    "zekr":
        "أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يُعَافِيَكَ وَيَشْفِيَكَ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "الترمذي",
    "zekr":
        "اللَّهُمَّ بَرِّدْ قَلْبِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ ، اللَّهُمَّ نَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "أبو داود",
    "zekr":
        "اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ، اللَّهُمَّ لَا يُهْزَمُ جُنْدُكَ، وَلَا يُخْلَفُ وَعْدُكَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ، سُبْحَانَكَ وَبِحَمْدِكَ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "مسلم",
    "zekr":
        "بِاسْمِ اللَّهِ يُبْرِيكَ، وَمِنْ كُلِّ دَاءٍ يَشْفِيكَ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ، وَشَرِّ كُلِّ ذِي عَيْنٍ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "أحمد",
    "zekr":
        "اللَّهُمَّ اشْفِ عَبْدَكَ يَنْكَأُ لَكَ عَدُوًّا ، أَوْ يَمْشِي لَكَ إِلَى صَلاةٍ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "البخاري",
    "zekr":
        "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ  فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ."
  },
  {
    "category": "الرُّقية الشرعية من السنة النبوية",
    "count": "",
    "description": "",
    "reference": "مسلم",
    "zekr":
        "بِسْمِ اللَّهِ أرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، وَمِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ، اللهُ يَشْفِيكَ، بِسمِ اللَّهِ أَرقِيكَ"
  }
];
