List wird = [
  {
    "text":
        "أعوذ بالله السميع العليم من الشيطان الرجيم بِسْمِ اللهِ الرَّحْمـَنِ الرَّحِيمِ , الْحَمْدُ للهِ رَبِّ الْعَالَمِينَ , الرَّحْمـنِ الرَّحِيمِ , مَـلِكِ يَوْمِ الدِّينِ إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ , اهدِنَـا الصِّرَاطَ المُستَقِيمَ , صِرَاطَ الَّذِينَ أَنعَمتَ عَلَيهِمْ غَيرِ المَغضُوبِ عَلَيهِمْ وَلاَ الضَّالِّينَ .",
    "counter": 3,
  },
  {
    "text":
        "(الـم , ذَلِكَ الْكِتَابُ لاَ رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ , الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ , والَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالآخِرَةِ هُمْ يُوقِنُونَ , أُوْلَـئِكَ عَلَى هُدًى مِّن رَّبِّهِمْ وَأُوْلَـئِكَ هُمُ الْمُفْلِحُونَ) (البقرة:1-5).",
    "counter": 1,
  },
  {
    "text":
        "(اللهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ , لاَ إِكْرَاهَ فِي الدِّينِ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن بِاللهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىَ لاَ انفِصَامَ لَهَا وَاللهُ سَمِيعٌ عَلِيمٌ , اللهُ وَلِيُّ الَّذِينَ آمَنُواْ يُخْرِجُهُم مِّنَ الظُّلُمَاتِ إِلَى النُّوُرِ وَالَّذِينَ كَفَرُواْ أَوْلِيَآؤُهُمُ الطَّاغُوتُ يُخْرِجُونَهُم مِّنَ النُّورِ إِلَى الظُّلُمَاتِ أُوْلَـئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ) (البقرة:255-257)",
    "counter": 1,
  },
  {
    "text":
        "(للهِ ما فِي السَّمَاواتِ وَمَا فِي الأَرْضِ وَإِن تُبْدُواْ مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللهُ فَيَغْفِرُ لِمَن يَشَاء وَيُعَذِّبُ مَن يَشَاء وَاللهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ , آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ , لاَ يُكَلِّفُ اللهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ) (البقرة:284-286).",
    "counter": 1,
  },
  {
    "text":
        "بسم الله الرحمن الرحيم ، قُلْ هُوَ اللهُ أَحَدٌ , اللهُ الصَّمَدُ , لَمْ يَلِدْ وَلَمْ يُولَدْ , وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
    "counter": 3,
  },
  {
    "text":
        "بسم الله الرحمن الرحيم، قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ , مِن شَرِّ مَا خَلَقَ , وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ , وَمِن شَرِّ النَّفّاثَاتِ فِي الْعُقَدِ , وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "counter": 3,
  },
  {
    "text":
        "بسم الله الرحمن الرحيم، قُلْ أَعُوذُ بِرَبِّ النَّاسِ , مَلِكِ النَّاسِ, إِلَهِ النَّاسِ , مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ, الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ , مِنَ الْجِنَّةِ وَالنَّاسِ",
    "counter": 3,
  },
  {
    "text":
        "أصبحنا وأصبح (أمسينا وأمسى) الملك لله ، والحمد لله لا شريك له ، لا إله إلا هو وإليه النشور (المصير)",
    "counter": 3,
  },
  {
    "text":
        "أصبحنا (أمسينا) على فطرة الإسلام ، وكلمة الإخلاص ، وعلى دين نبينا محمد صلى الله عليه وسلم وعلى ملة أبينا إبراهيم حنيفا وما كان من المشركين",
    "counter": 3,
  },
  {
    "text":
        "اللهم إني أصبحت (أمسيت) منك في نعمة وعافية وستر , فأتم علي نعمتك وعافيتك وسترك في الدنيا والآخرة",
    "counter": 3,
  },
  {
    "text":
        "اللهم ما أصبح (ما أمسى) بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك فلك الحمد ولك الشكر.",
    "counter": 3,
  },
  {
    "text": "يا ربي لك الحمد كما ينبغي لجلال وجهك وعظيم سلطانك.",
    "counter": 3,
  },
  {
    "text": "رضيت بالله ربا , وبالإسلام دينا , وبمحمد نبيا ورسولا ً.",
    "counter": 3,
  },
  {
    "text": "سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته.",
    "counter": 3,
  },
  {
    "text":
        "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم.",
    "counter": 3,
  },
  {
    "text": "اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ونستغفرك لما لا نعلمه.",
    "counter": 3,
  },
  {
    "text": "أعوذ بكلمات الله التامات من شر ما خلق.",
    "counter": 3,
  },
  {
    "text":
        "اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعـوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين وقهر الرجال.",
    "counter": 3,
  },
  {
    "text": "اللهم عافني في بدني , اللهم عافني في سمعي , اللهم عافني في بصري",
    "counter": 3,
  },
  {
    "text":
        "اللهم إني أعوذ بك من الكفر والفقر , اللهم إنـي أعـوذ بـك مـن عـذاب الـقـبـر لا إله إلا أنت",
    "counter": 3,
  },
  {
    "text":
        "اللهم أنت ربي ، لا إله إلا أنت , خلقتني وأنا عبـدك , وأنـا علـى عهـدك ووعدك ما استطعت ، أعوذ بك من شر ما صنعت ، أبـوء لـك بنعمتك علي , وأبـوء بـذنبـي فاغفر لي فإنه لا يغفر الذنوب إلا أنت.",
    "counter": 3,
  },
  {
    "text": "استغفر الله العظيم الذي لا اله الا هو الحي القيوم و اتوب اليه",
    "counter": 1,
  },
  {
    "text":
        "اللهم صل على سيدنا محمد عبدك ورسولك النبي الأمي وعلى آله وصحبه وسلم تسليما عدد ما أحاط به علمك وخط به قلمك وأحصاه كتابك، وارض اللهم عن سادتنا أبي بكر وعمر وعثمان وعلي، وعن الصحابة أجمعين، وعن التابعين وتابعيهم بإحسان إلى يوم الدين",
    "counter": 3,
  },
  {
    "text": "سبحان الله والحمد لله ولااله الاالله والله اكبر ",
    "counter": 3,
  },
  {
    "text":
        "لا اله الا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير",
    "counter": 1,
  },
  {
    "text": "سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت استغفرك وأتوب إليك.",
    "counter": 3,
  },
  {
    "text":
        "اللهم صل وسلم وبارك على سيدنا محمد عبدك ورسولك النبي الأمي وعلى آله وصحبه تسليما عدد ما أحاط به علمك وخط به قلمك وأحصاه كتابك وارضى اللهم عن ساداتنا ابي بكر وعمر وعلى وعثمان وعن الصحابة أجمعين وعن التابعين وتابعيهم بإحسان إلى يوم الدين سبحان ربك رب العزة عما يصفون وسلام عن المرسلين والحمد لله رب العالمين",
    "counter": 1,
  },
  {
    "text":
        "{قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ تُؤْتِى الْمُلْكَ مَن تَشَآءُ وَتَنزِعُ الْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ بِيَدِكَ الْخَيْرُ إِنَّكَ عَلَى كُلِّ شَيءٍ قَدِيرٌ * تُولِجُ الليْلَ فِي الْنَّهَارِ وَتُولِجُ النَّهَارَ فِي الليلِ وَتُخْرِجُ الْحَي مِنَ الْمَيِّتِ وَتُخْرِجُ الَمَيِّتَ مِنَ الْحَي وَتَرْزُقُ مَن تَشَآءُ بِغَيْرِ حِسَابٍ}(26ـ27).",
    "counter": 1,
  },
  {
    "text": " اللهم إن هذا إقبال ليلك، وإدبار نهارك، وأصوات دعاتك",
    "counter": 1,
  },
  {
    "text":
        "اللهم إنك تعلم أن هذه القلوب قد اجتمعت على محبتك، والتقت على طاعتك وتوحدت على دعوتك، وتعاهدت على نصرت شريعتك. فوثق اللهم رابطتها وآدام ودها، وأهداها سبلها وأملئها بنورك الذي لا يخبو. واشرح صدورها بفيض الإيمان بك وجميل التوكل عليك، وأحيها بمعرفتك، وأمتها على الشهادة في سبيلك، إنك نعم المولى ونعم النصير. اللهم آمين",
    "counter": 1,
  },
];
